[
    {
        "NAACCR Item #": null, 
        "allowable_values": null, 
        "analytical note": null, 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": "Unique case identification number assigned to the case in the PUF.", 
        "field_name": "PUF_CASE_ID", 
        "format": null, 
        "length": "37", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: NCDB assigned value that uniquely identifies each case included in the PUF. The value assigned to each case is selected at random, and the value assigned to each case will change with each issued PUF. The PUF Case IDs are not the same across cancer sites, and cases cannot be linked across cancer sites.      Note that the length of this key was expanded from 10 to 37 in January 2014.      ", 
        "registry_coding_instructions": "None.", 
        "table": {}, 
        "title": "Case Key"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": null, 
        "analytical note": null, 
        "category": "FACILITY", 
        "description": "The facility reporting the case to the NCDB. Codes are anonymized. The facility random IDs are assigned regardless of cancer site, so you may identify the same facilities across cancer sites. ", 
        "field_name": "PUF_FACILITY_ID", 
        "format": null, 
        "length": "10", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {}, 
        "title": "Facility Key"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "1, 2, 3, 4, 9", 
        "analytical note": "For additional information about CoC accreditation categories see https://www.facs.org/quality-programs/cancer/accredited/about/categories. Please note that for hospitals who are categorized as Integrated Network Cancer Programs, there is no information in the PUF data as to when these facilities became part of a Network.  Some facilities may have been in a Network throughout the time period in the PUF, whereas others may have only recently become part of a Network. Additionally, facilities designated in the Network category could previously been assigned a different category before joining their Network, such as Community, Academic, etc. Keep this in mind when analyzing facility type data, as Networks are comprised of several different types of facilities, but are only classified as Integrated Network Cancer Program in the PUF data. The hospital category in the PUF only represents the current designation of the facility.      See  Data De-identification and Confidentiality for a description of the handling of some categories. Please note that VA/DoD facilities are not included in the PUF files, and therefore are not identifiable as a type of cancer program.      This item is suppressed for cases aged 0-39.", 
        "category": "FACILITY", 
        "description": "Each facility reporting cases to the NCDB is assigned a category classification by the Commission on Cancer Accreditation program.  This item provides a general classification of the structural characteristics of each reporting facility.  ", 
        "field_name": "FACILITY_TYPE_CD", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "1": [
                "Community Cancer Program"
            ], 
            "2": [
                "Comprehensive Community Cancer Program"
            ], 
            "3": [
                "Academic/Research Program (includes NCI-designated comprehensive cancer centers)"
            ], 
            "4": [
                "Integrated Network Cancer Program"
            ], 
            "9": [
                "Other or unknown types of cancer programs"
            ]
        }, 
        "title": "Facility Type"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "1 - 9", 
        "analytical note": "This item is suppressed for cases aged 0-39.", 
        "category": "FACILITY", 
        "description": "The US Census Division of the reporting facility.", 
        "field_name": "FACILITY_LOCATION_CD", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {
            "1": [
                "New England", 
                "CT, MA, ME, NH, RI, VT"
            ], 
            "2": [
                "Middle Atlantic", 
                "NJ, NY, PA"
            ], 
            "3": [
                "South Atlantic", 
                "DC, DE, FL, GA, MD, NC, SC, VA, WV"
            ], 
            "4": [
                "East North Central", 
                "IL, IN, MI, OH, WI"
            ], 
            "5": [
                "East South Central", 
                "AL, KY, MS, TN"
            ], 
            "6": [
                "West North Central", 
                "IA, KS, MN, MO, ND, NE, SD"
            ], 
            "7": [
                "West South Central", 
                "AR, LA, OK, TX"
            ], 
            "8": [
                "Mountain", 
                "AZ, CO, ID, MT, NM, NV, UT, WY"
            ], 
            "9": [
                "Pacific", 
                "AK, CA, HI, OR, WA"
            ]
        }, 
        "title": "Facility Location"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0, 1", 
        "analytical note": "All CoC accredited programs that initially diagnose a patient or that provide all or part of first course treatment report the case. If more than one facility submitted a report, the \"best\" is provided in the PUF file based on recency of patient contact with the program, completeness of coded detail and/or edit quality, where differences exist. The record used in the case of ties is arbitrary. If this item is coded 0, only one facility provided a report for this cancer.      This item is used for hospital-level comparisons, surgical volume, distance or other hospital-level computations in order to take into account cases treated at more than one hospital.      If a patient received treatment in an outpatient facility or a non-CoC accredited facility, they could still have a code of 0 for this variable, if only one record for this patient was submitted to the NCDB. For these patients, they could have a Summary Treatment variable indicating that they received treatment (for example Chemotherapy= 1,2 or 3), but the hospital level treatment variable could indicate that no treatment was received at the facility included in the PUF (for example Chemotherapy at this Facility = 0).  This would occur if a patient was diagnosed and/or treated in only one CoC facility but received treatment in an outpatient setting or in a non-CoC facility.", 
        "category": "FACILITY", 
        "description": "Identifies whether there was more than one CoC facility that submitted a report for this case to NCDB.  ", 
        "field_name": "PUF_MULT_SOURCE ", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = Only one CoC facility reported this case to NCDB      1 = Records pertaining to this case submitted to NCDB by more than one CoC facility      ", 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "Patient Treated in More than One CoC Facility?"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0, 1", 
        "analytical note": "Every facility has a reference date, from which they are accountable for the completeness of the data for cases diagnosed in that year through the present. Since a facility may request to move their reference date forward, there are some instances where a case's diagnosis year falls before the facility's reference date. This item is coded 0 in cases where this occurs. A 1 signifies cases where the diagnosis year is on or after the reference date year. Reports for cases whose diagnosis date is prior to the reference date cannot be changed or updated by the facility. For this reason, PUF researchers may choose to omit cases where the diagnosis date precedes the reference date, depending on the nature of the study.", 
        "category": "FACILITY", 
        "description": "Identifies whether a report for a case has a diagnosis date before or after the facility's reference date.", 
        "field_name": "REFERENCE_DATE_FLAG", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = Diagnosis date before reference date      1 = Diagnosis date on or after reference date      ", 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "Reference Date Flag"
    }, 
    {
        "NAACCR Item #": "2300", 
        "allowable_values": "000 - 090, 999", 
        "analytical note": "In utero Date of Initial Diagnosis (NAACCR Item #390) was coded as equal to the Date of Birth (NAACCR Item #240) in the past. Beginning in 2009, assignment is to the pre-birth date on which the diagnosis occurs. Age at Diagnosis is assigned 000 for these cases.      For compliance with HIPAA privacy requirements, all patients age 90 or over at diagnosis are shown as 090.", 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": "Records the age of the patient at his or her last birthday before diagnosis.", 
        "field_name": "AGE", 
        "format": null, 
        "length": "3", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "If the patient has multiple primaries, then the age at diagnosis may be different for subsequent primaries.", 
        "table": {
            "000": [
                "Less than one year old, or diagnosed in utero"
            ], 
            "001-089": [
                "One to eighty nine years old"
            ], 
            "090": [
                "Ninety or older"
            ], 
            "999": [
                "Age at diagnosis unknown"
            ]
        }, 
        "title": "Patient Age"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "1 - 4, 9", 
        "analytical note": "Due to low case counts, any sex other than male or female is suppressed in the PUF data.", 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": "Identifies the sex of the patient.", 
        "field_name": "SEX", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Record the patient's sex as indicated in the medical record.", 
        "table": {
            "1": [
                "Male"
            ], 
            "2": [
                "Female"
            ]
        }, 
        "title": "Sex"
    }, 
    {
        "NAACCR Item #": "160", 
        "allowable_values": " 01 - 08, 10-17, 20 - 22, 25 - 28, 30 - 32, 96 - 99", 
        "analytical note": null, 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": "Identifies the primary race of the person", 
        "field_name": "RACE", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Race is analyzed with Spanish/Hispanic Origin  (NAACCR Item #190). Both items must be recorded. All tumors for the same patient should have the same race code.      Codes 08-13 became effective with diagnoses on or after January 1, 1988.      Code 14 became effective with diagnoses on or after January 1, 1994.      Codes 15 was changed from 09 and split into 16 and 17 in 2010; converted cases are likely to appear as 15.      Codes 20-97 became effective with diagnoses on or after January 1, 1991. SEER participants in San Francisco, San Jose,Monterey, and Los Angeles are permitted to use codes 14 and 20-97 for cases diagnosed after January 1, 1987.      Note: Beginning in 2001 cancer registries recorded multiple race codes, as many as five.  These additional race codes are infrequently reported and are not provided as part of this file.", 
        "table": {
            "1": [
                "White"
            ], 
            "10": [
                "Vietnamese"
            ], 
            "11": [
                "Laotian"
            ], 
            "12": [
                "Hmong"
            ], 
            "13": [
                "Kampuchean (including Khmer and Cambodian)"
            ], 
            "14": [
                "Thai"
            ], 
            "15": [
                "Asian Indian or Pakistani, NOS (formerly code 09)"
            ], 
            "16": [
                "Asian Indian"
            ], 
            "17": [
                "Pakistani"
            ], 
            "2": [
                "Black"
            ], 
            "20": [
                "Micronesian, NOS"
            ], 
            "21": [
                "Chamorran"
            ], 
            "22": [
                "Guamanian, NOS"
            ], 
            "25": [
                "Polynesian, NOS"
            ], 
            "26": [
                "Tahitian"
            ], 
            "27": [
                "Samoan"
            ], 
            "28": [
                "Tongan"
            ], 
            "3": [
                "American Indian, Aleutian, or Eskimo"
            ], 
            "30": [
                "Melanesian, NOS"
            ], 
            "31": [
                "Fiji Islander"
            ], 
            "32": [
                "New Guinean"
            ], 
            "4": [
                "Chinese"
            ], 
            "5": [
                "Japanese"
            ], 
            "6": [
                "Filipino"
            ], 
            "7": [
                "Hawaiian"
            ], 
            "8": [
                "Korean"
            ], 
            "96": [
                "Other Asian, including Asian, NOS and Oriental, NOS"
            ], 
            "97": [
                "Pacific Islander, NOS"
            ], 
            "98": [
                "Other"
            ], 
            "99": [
                "Unknown"
            ]
        }, 
        "title": "Race"
    }, 
    {
        "NAACCR Item #": "190", 
        "allowable_values": "0 - 7, 9", 
        "analytical note": null, 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": "Identifies persons of Spanish or Hispanic origin.", 
        "field_name": "SPANISH_HISPANIC_ORIGIN", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Persons of Spanish or Hispanic origin may be of any race, but these categories are generally not used for Native Americans, Filipinos, or others who may have Spanish names. Code 0 (Non-Spanish; non-Hispanic) for Portuguese and Brazilian persons. If the patient has multiple tumors, all records should have the same code.", 
        "table": {
            "0": [
                "Non-Spanish; non-Hispanic"
            ], 
            "1": [
                "Mexican (includes Chicano)"
            ], 
            "2": [
                "Puerto Rican"
            ], 
            "3": [
                "Cuban"
            ], 
            "4": [
                "South or Central America (except Brazil)"
            ], 
            "5": [
                "Other specified Spanish/Hispanic origin (includes European)"
            ], 
            "6": [
                "Spanish, NOS; Hispanic, NOS; Latino, NOS (There is evidence other than surname or maiden name that the person is Hispanic, but he/she cannot be assigned to any category of 1 - 5)"
            ], 
            "7": [
                "Spanish surname only (The only evidence of the person's Hispanic origin is surname or maiden name, and there is no contrary evidence that the person is not Hispanic)"
            ], 
            "8": [
                "Dominican Republic (for use with patients who were diagnosed with cancer on January 1, 2005, or later)"
            ], 
            "9": [
                "Unknown whether Spanish or not; not stated in patient record"
            ]
        }, 
        "title": "Spanish Origin"
    }, 
    {
        "NAACCR Item #": "630", 
        "allowable_values": "0 - 9", 
        "analytical note": null, 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": " Identifies the patient's primary insurance carrier at the time of initial diagnosis and/or treatment.   ", 
        "field_name": "INSURANCE_STATUS", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {
            "0": [
                "Not Insured"
            ], 
            "1": [
                "Private Insurance / Managed Care"
            ], 
            "2": [
                "Medicaid"
            ], 
            "3": [
                "Medicare"
            ], 
            "4": [
                "Other Government"
            ], 
            "9": [
                "Insurance Status Unknown"
            ]
        }, 
        "title": "Primary Payer"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "1 - 4, 9", 
        "analytical note": null, 
        "category": "Income", 
        "description": "Median household income for each patient's area of residence is estimated by matching the zip code of the patient recorded at the time of diagnosis against files derived from year 2000 US Census data.  Household income is categorized as quartiles based on equally proportioned income ranges among all US zip codes.  ", 
        "field_name": "MED_INC_QUAR_00", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "1": [
                "Less than $30,000"
            ], 
            "2": [
                "$30,000 - $34,999"
            ], 
            "3": [
                "$35,000 - $45,999"
            ], 
            "4": [
                "$46,000 +"
            ], 
            "Blank": [
                "Not Available"
            ]
        }, 
        "title": "Income 2000"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": " 1 - 4, 9", 
        "analytical note": null, 
        "category": "Education", 
        "description": "This measure of educational attainment for each patient's area of residence is estimated by matching the zip code of the patient recorded at the time of diagnosis against files derived from year 2000 US Census data.  This item provides a measure of the number of adults in the patient's zip code who did not graduate from high school, and is categorized as equally proportioned quartiles among all US zip codes.   ", 
        "field_name": "NO_HSD_QUAR_00", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "1": [
                "29% or more"
            ], 
            "2": [
                "20% - 28.9%"
            ], 
            "3": [
                "14%-19.9%"
            ], 
            "4": [
                "Less than 14%"
            ], 
            "Blank": [
                "Not Available"
            ]
        }, 
        "title": "Education 2000"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": " 1 - 9", 
        "analytical note": "This item was estimated by matching the state and county FIPS code of the patient recorded at the time of diagnosis against 2003 files published by the United States Department of Agriculture Economic Research Service (http://www.ers.usda.gov/data-products/rural-urban-continuum-codes).      Rural-Urban continuum codes form a classification scheme that distinguishes metropolitan (metro) counties by the population size of their metro area, and nonmetropolitan (nonmetro) counties by degree of urbanization and adjacency to a metro area or areas. The metro and nonmetro categories have been subdivided into three metro and six nonmetro groupings, resulting in a nine-part county codification. The codes allow researchers working with data to break such data into finer residential groups beyond a simple metro-nonmetro dichotomy, particularly for the analysis of trends in nonmetro areas that may be related to degree of rurality and metro proximity.", 
        "category": "Urban/Rural", 
        "description": "Area-based measure of rurality and urban influence, using the typology published by the USDA Economic Research Service.  ", 
        "field_name": "UR_CD_03", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "1": [
                "Counties in metro areas of 1 million population or more"
            ], 
            "2": [
                "Counties in metro areas of 250,000 to 1 million population"
            ], 
            "3": [
                "Counties in metro areas of fewer than 250,000 population"
            ], 
            "4": [
                "Urban population of 20,000 or more, adjacent to a metro area"
            ], 
            "5": [
                "Urban population of 20,000 or more, not adjacent to a metro area"
            ], 
            "6": [
                "Urban population of 2,500 to 19,999, adjacent to a metro area"
            ], 
            "7": [
                "Urban population of 2,500 to 19,999, not adjacent to a metro area"
            ], 
            "8": [
                "Completely rural or less than 2,500 urban population, adjacent to a metro area"
            ], 
            "9": [
                "Completely rural or less than 2,500 urban population, not adjacent to a metro area"
            ], 
            "Blank": [
                "Not Available"
            ]
        }, 
        "title": "Urban/Rural 2003"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": " 1 - 4, 9", 
        "analytical note": null, 
        "category": "Income", 
        "description": "Median household income for each patient's area of residence is estimated by matching the zip code of the patient recorded at the time of diagnosis against files derived from the 2012 American Community Survey data, spanning years 2008-2012 and adjusted for 2012 inflation. Household income is categorized as quartiles based on equally proportioned income ranges among all US zip codes. ", 
        "field_name": "MED_INC_QUAR_12", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "1": [
                "Less than $38,000"
            ], 
            "2": [
                "$38,000 - $47,999"
            ], 
            "3": [
                "$48,000 - $62,999"
            ], 
            "4": [
                "$63,000 +"
            ], 
            "Blank": [
                "Not Available"
            ]
        }, 
        "title": "Income 2008-2012"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "1-4, 9", 
        "analytical note": null, 
        "category": "Education", 
        "description": "This measure of educational attainment for each patient's area of residence is estimated by matching the zip code of the patient recorded at the time of diagnosis against files derived from the 2012 American Community Survey data, spanning years 2008-2012. This item provides a measure of the number of adults in the patient's zip code who did not graduate from high school, and is categorized as equally proportioned quartiles among all US zip codes. ", 
        "field_name": "NO_HSD_QUAR_12", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "1": [
                "21% or more"
            ], 
            "2": [
                "13% - 20.9%"
            ], 
            "3": [
                "7%-12.9%"
            ], 
            "4": [
                "Less than 7%"
            ], 
            "Blank": [
                "Not Available"
            ]
        }, 
        "title": "Education 2008-2012"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "1 - 9", 
        "analytical note": "This item was estimated by matching the state and county FIPS code of the patient recorded at the time of diagnosis against 2013 files published by the United States Department of Agriculture Economic Research Service (http://www.ers.usda.gov/data-products/rural-urban-continuum-codes).      Rural-Urban continuum codes form a classification scheme that distinguishes metropolitan (metro) counties by the population size of their metro area, and nonmetropolitan (nonmetro) counties by degree of urbanization and adjacency to a metro area or areas. The metro and nonmetro categories have been subdivided into three metro and six nonmetro groupings, resulting in a nine-part county codification. The codes allow researchers working with data to break such data into finer residential groups beyond a simple metro-nonmetro dichotomy, particularly for the analysis of trends in nonmetro areas that may be related to degree of rurality and metro proximity.      Since labels for the 2013 classification codes are the same as the 2003 labels, a direct comparison with the 2003 Urban/Rural codes may be made.", 
        "category": "Urban/Rural", 
        "description": "Area-based measure of rurality and urban influence, using the typology published by the USDA Economic Research Service.", 
        "field_name": "UR_CD_13", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "1": [
                "Counties in metro areas of 1 million population or more"
            ], 
            "2": [
                "Counties in metro areas of 250,000 to 1 million population"
            ], 
            "3": [
                "Counties in metro areas of fewer than 250,000 population"
            ], 
            "4": [
                "Urban population of 20,000 or more, adjacent to a metro area"
            ], 
            "5": [
                "Urban population of 20,000 or more, not adjacent to a metro area"
            ], 
            "6": [
                "Urban population of 2,500 to 19,999, adjacent to a metro area"
            ], 
            "7": [
                "Urban population of 2,500 to 19,999, not adjacent to a metro area"
            ], 
            "8": [
                "Completely rural or less than 2,500 urban population, adjacent to a metro area"
            ], 
            "9": [
                "Completely rural or less than 2,500 urban population, not adjacent to a metro area"
            ], 
            "Blank": [
                "Not Available"
            ]
        }, 
        "title": "Urban/Rural 2013"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": null, 
        "analytical note": "Residential latitude and longitude are based on the patient's zip code centroid or on the city if the zip code was not available. Hospital locations are based on the street address for the facility. The great circle distance is calculated between those two points. In some instances, the residential city is outside of the United States, so the upper bound of distance may be quite large. A distance of 0 can result when the patient lives in the same zip code where the facility is located.      The Haversine (half-versed-sine) formula is used to calculate the distance between the two locations. It was published by R W Sinnott in Sky and Telescope, 1984,though known about for much longer by navigators.", 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": "The \"great circle\" distance in miles between the patient's residence and the hospital that reported the case.", 
        "field_name": "CROWFLY", 
        "format": null, 
        "length": "8", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "Great Circle Distance"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 3", 
        "analytical note": "Because of the small proportion of cases with a Charlson Comorbidity score exceeding 3, the data have been truncated to 0, 1, 2, 3 (greater than or equal to 3).  A score of 0 indicates \"no comorbid conditions recorded\", or none of the values shown below. Patients with a score of 0 could still have comorbidities if they are conditions that are not included in the mapping table below. Note that the patient's cancer is not directly reflected in the recorded score.            Two examples illustrating how the Charlson Score is summarized for the PUF data: If a patient had a myocardial infarction, diabetes, and renal disease, the cumulative score would be 4, and the value shown in the PUF would be 3. If a patient had severe liver disease, the value in the PUF would also be 3, since the Charlson Score of severe liver disease is 3.", 
        "category": "PATIENT DEMOGRAPHICS", 
        "description": "Comorbid conditions as described by Charlson/Deyo (1992) [1] are mapped from as many as ten reported ICD-9-CM or ICD-10 secondary diagnosis codes. The Charlson/Deyo value is a weighted score derived from the sum of the scores for each of the comorbid conditions listed in the Charlson Comorbidity Score Mapping Table  (source: http://mchp-appserv.cpe.umanitoba.ca/viewConcept.php?conceptID=109 ). The range for this value is between 0 and 25. Starting with the 2015 PUF released in the Fall of 2017, ICD-10 codes are incorporated into the score calculation for cases diagnosed in 2006-2015. Registries were able to submit ICD-10 codes starting in 2006.  However, very few ICD-10 codes were submitted until 2015.  The 2015 Charlson-Deyo Score is derived from the highest score that is calculated from using either the ICD-9 codes or the ICD-10 codes.   The allowable values have also been extended to now include values up to 3 or more.", 
        "field_name": "CDCC_TOTAL_BEST", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {
            "0": [
                "     Total Charlson Deyo Score of  0 "
            ], 
            "1": [
                "     Total  Charlson-Deyo score of 1"
            ], 
            "2": [
                "     Total Charlson-Deyo Score of 2 "
            ], 
            "3": [
                "     Total Charlson -Deyo Score of 3 or  more "
            ], 
            "AIDS": [
                "6"
            ], 
            "Cerebrovascular Disease": [
                "1"
            ], 
            "Chronic Pulmonary Disease": [
                "1"
            ], 
            "Congestive Heart Failure": [
                "1"
            ], 
            "Dementia": [
                "1"
            ], 
            "Diabetes": [
                "1"
            ], 
            "Diabetes with Chronic Complications": [
                "2"
            ], 
            "Hemiplegia or Paraplegia": [
                "2"
            ], 
            "Mild Liver Disease": [
                "1"
            ], 
            "Moderate or Severe Liver Disease": [
                "3"
            ], 
            "Myocardial Infarction": [
                "1"
            ], 
            "Peptic Ulcer Disease": [
                "1"
            ], 
            "Peripheral Vascular Disease": [
                "1"
            ], 
            "Renal Disease": [
                "2"
            ], 
            "Rheumatologic Disease": [
                "1"
            ]
        }, 
        "title": "Charlson/Deyo Score"
    }, 
    {
        "NAACCR Item #": "560", 
        "allowable_values": "00 - 88, 99", 
        "analytical note": null, 
        "category": "CANCER IDENTIFICATION", 
        "description": "Indicates the sequence of malignant and non-malignant neoplasms over the lifetime of the patient.   ", 
        "field_name": "SEQUENCE_NUMBER", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Codes 00 - 59 and 99 indicate neoplasms of in situ or invasive malignant behavior (Behavior equals 2 or 3). Codes 60 - 88 indicate neoplasms of benign or borderline non-malignant behavior (Behavior equals 0 or 1).      Code 00 only if the patient has a single malignant primary. If the patient develops a subsequent malignant invasive or in situ primary tumor, change the code for the first tumor from 00 to 01, and number subsequent tumors sequentially.      Code 99 is used in the rare situation for which the sequence of a malignant invasive or in situ tumor is unknown.      Code 60 only if the patient has a single non-malignant primary. If the patient develops a subsequent non-malignant primary, change the code for the first tumor from 60 to 61, and assign codes to subsequent non-malignant primaries sequentially.      Code 88 is used in the rare situation for which the sequence of a benign or borderline tumor is unknown.      If two or more malignant invasive or in situ neoplasms are diagnosed at the same time, assign the lowest sequence number to the diagnosis with the worst prognosis. If no difference in prognosis is evident, the decision is arbitrary.      If two or more non-malignant neoplasms are diagnosed at the same time, assign the lowest sequence number to the diagnosis with the worst prognosis. If no difference in prognosis is evident, the decision is arbitrary.      Any tumor in the patient's past which is reportable or reportable-by-agreement must be taken into account when sequencing subsequently accessioned tumors.      Sequence numbers should be reassigned if the facility learns later of an unaccessioned tumor that affects the sequence.", 
        "table": {}, 
        "title": "Sequence Number"
    }, 
    {
        "NAACCR Item #": "610", 
        "allowable_values": "00, 10-14, 20-22, 30-38, 40-43, 49, 99", 
        "analytical note": "The CoC Accreditation Program does not require hospitals to abstract nonanalytic cases (30-99).  Nonanalytic cases are not in the PUF data set, and are not included in the code definitions that follow.      The CoC Accreditation Program does not require Class of Case 00 cases diagnosed in 2006 or later to be staged or followed.  They are included in the PUF, but PUF users may want to omit them from some forms of analysis.      Codes for Class of Case were expanded in 2010.  For cases diagnosed prior to 2010, conversion of analytic cases was generally to Class of Case 00, 10 and 20; the other codes will not be well populated for earlier cases.      Only analytic Class of Case codes are included in the table below.", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Classifies cases recorded in the database.", 
        "field_name": "CLASS_OF_CASE", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Class of Case has 24 categories. Analytic cases are coded 00-22. Nonanalytic cases are coded 30-99.      Abstracting for analytic cases is to be completed within six months of the date of first contact.", 
        "table": {
            "00": [
                "Diagnosis at the reporting facility and all treatment or a decision not to treat was done elsewhere."
            ], 
            "10": [
                "Initial diagnosis at the reporting facility, and part or all of first course treatment or a decision not to treat was at the reporting facility, NOS."
            ], 
            "11": [
                "Initial diagnosis in a staff physician's office and part of first course treatment was done at the reporting facility."
            ], 
            "12": [
                "Initial diagnosis in a staff physician's office and all of first course treatment or a decision not to treate was done at the reporting facility."
            ], 
            "13": [
                "Initial diagnosis at the reporting facility and part of first course treatment was done at the reporting facility; part of first course treatment was done elsewhere."
            ], 
            "14": [
                "Initial diagnosis at the reporting facility and all of first course treatment or a decision not to treat was done at the reporting facility."
            ], 
            "20": [
                "Initial diagnosis elsewhere and all or part of first course treatment or a decision not to treat was done at the reporting facility, NOS."
            ], 
            "21": [
                "Initial diagnosis elsewhere and part of first course treatment was done at the reporting facility; part of first course treatment was done elsewhere."
            ], 
            "22": [
                "Initial diagnosis elsewhere and all of first course treatment or a decision not to treat was done at the reporting facility."
            ]
        }, 
        "title": "Class of Case"
    }, 
    {
        "NAACCR Item #": "390", 
        "allowable_values": null, 
        "analytical note": "Cancer registries record the full date of initial diagnosis, only the year portion of the reported date is provided in the PUF.      Cases with unknown year of diagnosis are not submitted to NCDB.", 
        "category": "CANCER IDENTIFICATION", 
        "description": " Records the year of initial diagnosis by a physician for the tumor being reported.   ", 
        "field_name": "YEAR_OF_DIAGNOSIS", 
        "format": "CCYY", 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Use the first date of diagnosis whether clinically or histologically confirmed. If the physician states that in retrospect the patient had cancer at an earlier date, then use the earlier date as the date of diagnosis.      Use the date therapy was started as the date of diagnosis if the patient receives a first course of treatment before a definitive diagnosis.      Refer to the list of \"Ambiguous Terms\" in Section One of Facility Oncology Registry Data Standards (FORDS) for language that represents a diagnosis of cancer.", 
        "table": {
            "9999": [
                "Year of diagnosis unknown (excluded from the PUF)"
            ], 
            "CCYY": [
                "Four digit year"
            ]
        }, 
        "title": "Year of Diagnosis"
    }, 
    {
        "NAACCR Item #": "400", 
        "allowable_values": null, 
        "analytical note": "The ICD-O-3 is not publicly available for electronic download, but the manual can be borrowed from hospital registrars. The codes are similar to ICD-10, but not identical; they may be found in an appendix of some ICD-10 publications (not to be confused with the ICD-10-CM).", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Identifies the primary site, that is, the anatomic site of origin for the cancer.", 
        "field_name": "PRIMARY_SITE", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Record the ICD-O-3 (International Classification of Diseases for Oncology, Third Edition) topography code for the site of origin.      Consult the physician advisor to identify the primary site or the most definitive site code if the medical record does not contain that information.      Primary site codes may be found in the ICD-O-3 Topography, Numerical List section (ICD-O-3, p. 43) and in the Alphabetic Index (ICD-O-3, p. 105).      Topography codes are indicated by a \"C\" preceding the three-digit code number (do not record the decimal point).      Follow the coding rules outlined in ICD-O-3, pp. 20-40.      Use subcategory 8 for single tumors that overlap the boundaries of two or more sub-sites and the point of origin is not known.      Use subcategory 9 for multiple tumors that originate in one organ.      Code adenocarcinoma in multiple polyps as a single primary even if they involve more than one segment of the colon.      Code leukemias to bone marrow (C42.1).      Exception: Code myeloid sarcoma to the site of origin (see ICD-O-3 for coding rules).", 
        "table": {}, 
        "title": "Primary Site"
    }, 
    {
        "NAACCR Item #": "410", 
        "allowable_values": "0 - 5, 9", 
        "analytical note": "Beginning with cases diagnosed in 2010, the code 5 is used for midline of paired sites.  This code is applicable for very few sites, because it requires that the two lateral portions be contiguous (laterality of the skin of most parts of the body has a midline; laterality of the breast does not).  For cases diagnosed prior to 2010, the midline was coded 9.  Those cases are rare, but will be coded 9 in pre-2010 PUF cases.      The following are paired sites:       Parotid gland      Submandibular gland      Sublingual gland      Tonsillar fossa      Tonsillar pillar      Overlapping lesion of tonsil      Tonsil, NOS      Nasal cavity (excluding nasal cartilage and nasal septum)      Middle ear      Maxillary sinus      Frontal sinus      Main bronchus (excluding carina)      Lung      Pleura      Long bones of upper limb and scapula      Short bones of upper limb      Long bones of lower limb      Short bones of lower limb      Rib and clavicle (excluding sterum)      Pelvic bones (excluding sacrum, coccyx, and symphysis pubis)      Skin of eyelid      Skin of external ear      Skin of other and unspecified parts of face      Skin of trunk      Skin of upper limb and shoulder      Skin of lower limb and hip      Peripheral nerves and autonomic nervous system of upper limb and shoulder      Peripheral nerves and autonomic nervous system of lower limb and hip      Connective, cutaneous and other soft tissue of upper limb and shoulder      Connective, cutaneous and other soft tissue of lower limb and hip      Breast      Ovary      Fallopian tube      Testis      Epididymis      Spermatic cord      Kidney, NOS      Renal pelvis      Ureter      Eye and lacrimal gland      Cerebral meninges, NOS (beginning with 2004 diagnoses)      Cerebrum (beginning with 2004 diagnoses)      Frontal lobe (beginning with 2004 diagnoses)      Temporal lobe (beginning with 2004 diagnoses)      Parietal lobe (beginning with 2004 diagnoses)      Occipital lobe (beginning with 2004 diagnoses)      Olfactory lobe (beginning with 2004 diagnoses)      Optic lobe (beginning with 2004 diagnoses)      Acoustic lobe (beginning with 2004 diagnoses)      Cranial nerve, NOS (beginning with 2004 diagnoses)      Adrenal gland      Carotid body", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Identifies the side of a paired organ or the side of the body on which the reportable tumor originated. This applies to the primary site only.   ", 
        "field_name": "LATERALITY", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Code laterality for all paired sites (see Analytic Note).      Code all nonpaired sites 0 (see Analytic Note).      Record laterality for unknown primary site (C80.9) as 0 (not a paired site).      Do not code metastatic sites as bilateral involvement.      Code midline lesions 5 (see Analytic Note).", 
        "table": {
            "0": [
                "Organ is not considered to be a paired site"
            ], 
            "1": [
                "Origin of primary is right"
            ], 
            "2": [
                "Origin of primary is left"
            ], 
            "3": [
                "Only one side involved, right or left origin not specified"
            ], 
            "4": [
                "Bilateral involvement, side of origin unknown, stated to be a single primary. This includes:      -Both ovaries simultaneously involved with a single histology      -Bilateral retinoblastomas      -Bilateral Wilms tumors"
            ], 
            "5": [
                "Midline of a paired site tumors"
            ], 
            "9": [
                "Paired site, but lateral origin unknown; midline tumor"
            ]
        }, 
        "title": "Laterality"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "See ICD-O-3 and the Hematopoeitic and Lymphoid Manual ", 
        "analytical note": "This item is the product of the application of the conversion rules expressed in ICDO2-3_SEER.xls (http://seer.cancer.gov/tools/conversion/index.html) for cases diagnosed prior to 2001, which were originally coded according to ICD-O-2, and the ICD-O-3 codes reported by registries for cases diagnosed in 2001 and subsequently. In addition, beginning with 2010 diagnoses, malignant hematopoietic and lymphoid histology codes not yet printed in the ICD-O-3 were added. For a list of the added codes, consult http://seer.cancer.gov/tools/heme/; the codes are in Appendix D of the Hematopoietic and Lymphoid Manual which can be accessed from the online or downloadable database files on that site. Hematopoietic and lymphatic cancers diagnosed prior to 2010 retain the earlier ICD-O-3 values.", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Records the tumor histology of all cases reported to the NCDB in International Classification of Disease for Oncology, Third Edition (ICD-O-3) terms. ", 
        "field_name": "HISTOLOGY", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "Histology"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 3", 
        "analytical note": "This item is the product of the application of the conversion rules expressed in ICDO2-3_SEER.xls (http://seer.cancer.gov/tools/conversion/index.html) for cases diagnosed prior to 2001, which were originally coded according to ICD-O-2, and ICD-O-3 codes reported by facilities for cases diagnosed in 2001 or later.      Note: the xls file was modified from that available from the SEER web site - behavior code 1 associated with juvenile astrocytomas (9421) has been changed to 3 by agreement among North American registry standard setters, making it consistent with ICD-O-2.      Benign tumors or tumors of uncertain behavior (behavior codes 0, 1) are not reported to the NCDB except for the following sites: meninges (C70._), brain (C71._), spinal cord, cranial nerves, and other parts of central nervous system (C72._), pituitary gland (C75.1), craniopharyngeal duct (C75.2) and pineal gland (C75.3). These were not required to be reported until 2004.", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Records the behavior of all cases reported to the NCDB. The fifth digit of the morphology code is the behavior code.  ", 
        "field_name": "BEHAVIOR", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {
            "0": [
                "Benign", 
                "Benign"
            ], 
            "1": [
                "Borderline", 
                "Uncertain whether benign or malignant"
            ], 
            "3": [
                "Invasive", 
                "Invasive or microinvasive"
            ]
        }, 
        "title": "Behavior"
    }, 
    {
        "NAACCR Item #": "440", 
        "allowable_values": "1-9", 
        "analytical note": "Although ICD-O-2 and ICD-O-3 Grade/Differentiation are collected as separate items, the only difference between the two editions is that code 8 (NK cells) was added after ICD-O-2 was initially published. They are combined in the PUF, as an output to the ICD-O-2 to ICD-O-3 conversion used for histology and behavior.", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Describes the tumor's resemblance to normal tissue. Well differentiated (Grade I) is the most like normal tissue, and undifferentiated (Grade IV) is the least like normal tissue. ", 
        "field_name": "GRADE", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Code grade according to ICD-O-3 (pp. 30-31 and 67).      Code the grade or differentiation as stated in the final pathologic diagnosis. If the differentiation is not stated in the final pathologic diagnosis, use the information from the microscopic description or comments.      When the pathology report(s) lists more than one grade of tumor, code to the highest grade, even if the highest grade is only a focus (Rule G, ICD-O-3, p. 21).      Code the grade or differentiation from the pathologic examination of the primary tumor, not from metastatic sites.      When there is no tissue diagnosis, it may be possible to establish grade through magnetic resonance imaging (MRI) or positron emission tomography (PET). When available, code grade based on the recorded findings from these imaging reports.      If the primary site is unknown, code the grade/differentiation as 9 (Unknown).      Code the grade for in situ lesions if the information is available. If the lesion is both invasive and in situ, code only the invasive portion. If the invasive component grade is unknown, then code 9.      Do not use \"high grade\", \"low grade\", or \"intermediate grade\" descriptions for lymphomas as a basis for differentiation. These terms are categories in the Working Formulation of Lymphoma Diagnoses and do not relate to grade/differentiation.      Codes 5-8 define T-cell or B-cell origin for leukemias and lymphomas. T-cell, B-cell, or null cell classifications have precedence over grading or differentiation.      Do not use the WHO grade to code this data item.      If no grade is given for astrocytomas, then code 9 (Unknown).       If no grade is given for glioblastoma multiforme, then code 9 (Unknown).", 
        "table": {
            "1": [
                "Grade I, 1, i", 
                "Well differentiated; differentiated, NOS"
            ], 
            "2": [
                "Grade II, 2, ii, I/III, or 1/3", 
                "Moderately differentiated; moderately well differentiated; intermediate differentiation"
            ], 
            "3": [
                "Grade III, 3, iii, II/III, or 2/3", 
                "Poorly differentiated"
            ], 
            "4": [
                "Grade IV, 4, iv, III/III, or 3/3", 
                "Undifferentiated; anaplastic"
            ], 
            "5": [
                "-", 
                "T cell; T-precursor"
            ], 
            "6": [
                "-", 
                "B cell; pre-B; B-precursor"
            ], 
            "7": [
                "-", 
                "Null cell; non T-non B"
            ], 
            "8": [
                "-", 
                "NK (natural killer) cell (effective with diagnosis 1/1/95 and after)"
            ], 
            "9": [
                "-", 
                "Cell type not determined, not stated or not applicable; unknown primaries; high grade dysplasia (adenocarcinoma in situ)"
            ]
        }, 
        "title": "Grade"
    }, 
    {
        "NAACCR Item #": "490", 
        "allowable_values": "1, 2, 4 - 9", 
        "analytical note": "In 2010, cancer registries in North America adopted new rules for coding hematopoietic and lymphoid tumors.  At that time, this item was modified for cases diagnosed in 2010 or later to better reflect the ways these tumors are diagnosed.  Code 3 was defined and implemented at that time, and the rules for coding were refined.  The instructions and table presented here represent a combination of the new instructions and the older instructions that still apply to solid tumors.", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Records the most definitive method of diagnostic confirmation of the cancer being reported at any time in the patient's history.   ", 
        "field_name": "DIAGNOSTIC_CONFIRMATION", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "For solid tumors only (histologies other than 9590-9992), this is a hierarchical schema to identify how the malignancy was determined - from histologic confirmation (1) being most precise to unknown (9) being the least. Lower numbered codes take precedence over higher numbered codes.  The code must be changed to a lower code if a more definitive method confirms the diagnosis at any time during the course of the disease.  Code 3 in the table below does NOT apply to solid tumors.      Separate rules were established for non-solid tumors (histology codes 9590-9992) in 2010.  Prior to that, registrars were instructed to use Code 1 for positive hematologic findings and bone marrow specimens for leukemia, including peripheral blood smears and aspiration biopsies.  Otherwise, to use Code 2 for positive brushings, washings, cell aspiration, and hematologic findings (except for leukemia).      For non-solid tumors (histology codes 9590-9992) beginning in 2010, the table below is NOT hierachical, and the rules for assignment are specific to non-solid tumors.      Coding Instructions for All Tumors      Assign Code 1 when the microscopic diagnosis is based on tissue specimens from biopsy, frozen section, surgery, autopsy, D&C or from aspiration or biopsy of bone marrow specimens.      Assign Code 2 when the microscopic diagnosis is based on cytologic examination of cells such as sputum smears, bronchial brushings, bronchial washings, prostatic secretions, breast secretions, gastric fluid, spinal fluid, pleural fluid, urinary sediment, cervical or vaginal smears, or from paraffin block speciments from concentrated spinal, pleural or peritoneal fluid.  These methods are rarely used for hematopoietic or lymphoid tumors.      Assign Code 5 when the diagnosis of cancer is based on laboratory tests or marker studies which are clinically diagnostic for that cancer.      Assign Code 6 when the diagnosis is based only on the surgeon's operative report or from a surgical exploration or endoscopy or from gross autopsy findings in the absence of tissue or cytologic findings.      Additional Coding Instructions for Hematopoietic or Lymphoid Tumors (Histologies 9590-9992)      There is no priority hierachy for coding Diagnostic Confirmation for hematopoietic and lymphoid tumors.  Most commonly, the specific histologic type is diagnosed by immunophenotypoing or genetic testing.  See the Hematopoietic Database (DB) for information on the definitive diagnostic confirmation for specific tumors.      For leukemia only, assign Code 1 when the diagnosis is based only on the complete blood count (CBC), white blood count (WBC) or peripheral blood smear.  Do not use Code 1 if the diagnosis was based on immunophenotyping or genetic testing using tissue, bone marrow, or blood.      Assign Code 3 when there is a histologic positive for cancer AND positive immuniphenotyping and/or postiive genetic testing results.  Do not use Code 3 for neoplasms diagnosed prior to January 1, 2010.      Assign Code 8 when the case was diagnosed by any clinical method that can not be coded as 6 or 7.  A number of hematopoietic and lymphoid neoplasms are dignosed by tests of exclusion where the tests for the disease are equivocal and the physician makes a clinical diagnosis based on the information from the equivocal tests and the patient's clinical presentation.      Assign Code 6 when the diagnosis is based only on the surgeon's operative report from a surgical exploration or endocscopy or from gross autopsy findings in the absence of tissue or cytologic findings.      Assign Code 1 when microscopic diagnosis is based on tissue specimens from biopsy, frozen section, surgery, autopsy or D&C or from aspiration of biopsy bone marrow specimens.      Assign Code 2 when microscopic diagnosis is based on cytologic examination of cells such as sputum smears, bronchial brushings, bronchial washings, prostatic secretions, breast secretions, gastric fluid, peritoneal fluid, urinary sediment, or peritoneal fluid.  These methods are rarely used for hematopoietic or lymphoid cancers.      Assign Code 5 when the diagnosis of cancer is based on laboratory tests or marker studies which are clinically diagnostic for that specific cancer.", 
        "table": {
            "1": [
                "Positive histology", 
                "Histologic confirmation (tissue microscopically examined)"
            ], 
            "2": [
                "Positive cytology", 
                "Cytologic confirmation (no tissue microscopically examined; fluid cells microscopically examined"
            ], 
            "3": [
                "Postive histology PLUS positive immunophenotyping and/or positive genetic studies", 
                "Histology is positive for cancer, and there are also positive immunophenotyping and/or genetic test results. Use this code only for histology range 9590-9992 where the year of diagnosis is 2010 or later"
            ], 
            "4": [
                "Positive microscopic confirmation, method not specified", 
                "Microscopic confirmation is all that is known. It is unknown if the cells were from histology or cytology"
            ], 
            "5": [
                "Positive laboratory test/marker study", 
                "A clinical diagnosis of cancer is based on laboratory tests/marker studies which are clinically diagnostic for cancer. This includes alpha-fetoprotein for liver cancer and abnormal electrophoretic spike for multiple myeloma. Elevated PSA is nondiagnostic of cancer. If the physician uses the PSA as a basis for diagnosing prostate cancer with no other workup, record as code 5. (Adapted from SEER.)"
            ], 
            "6": [
                "Direct visualization without microscopic confirmation", 
                "The tumor was visualized during a surgical/endoscopic procedure only with no tissue resected for microscopic examination"
            ], 
            "7": [
                "Radiography and other imaging techniques without microscopic confirmation", 
                "The malignancy was reported by the physician from an imaging technique report only"
            ], 
            "8": [
                "Clinical diagnosis only (other than 5, 6, or 7)", 
                "The malignancy was reported by the physician in the medical record"
            ], 
            "9": [
                "Unknown whether or not microscopically confirmed", 
                "A statement of malignancy was reported in the medical record, but there is no statement of how the cancer was diagnosed (usually Class of Case 3)"
            ]
        }, 
        "title": "Diagnostic Confirmation"
    }, 
    {
        "NAACCR Item #": "820", 
        "allowable_values": "00 - 99", 
        "analytical note": "This item became part of the Collaborative Stage Data Collection System when CS was implemented in 2004. The PUF item reflects data submitted at any time, regardless of the applicable manual.", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Records the exact number of regional lymph nodes examined by the pathologist and found to contain metastases.   ", 
        "field_name": "REGIONAL_NODES_POSITIVE", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Only record information about regional lymph nodes in this item.      This item is based on pathology information only. If no lymph nodes were removed for examination, or if a lymph node drainage area was removed, but no lymph nodes were found, code 98.      Record the total number of regional lymph nodes removed and found to be positive by pathologic examination.      The number of regional lymph nodes positive is cumulative from all procedures that removed lymph nodes through the completion of surgeries in the first course of treatment.      This item is to be recorded regardless of whether the patient received preoperative treatment.      Any combination of positive aspirated, biopsied, sampled or dissected lymph nodes is coded 97 if the number of involved nodes cannot be determined on the basis of cytology or histology.      Code 99 for the following sites and histologies:      Brain and Cerebral Meninges (C70.0, C71.0-C71.9)      Other Parts of Central Nervous System (C70.1, C70.9, C72.0-C72.5, C72.8-C72.9)      Hodgkin and non-Hodgkin Lymphoma (M-959-972 EXCEPT 9700/3 and 9701/3)      Hematopoietic, Reticuloendothelial, Immunoproliferative and Myeloproliferative Neoplasms (M-9731-9734, 9740-9742, 9750-9758, 9760-9762, 9764-9769, 9800-9801, 9805, 9820, 9823, 9826-9827, 9831-9837, 9840, 9860-9861, 9863, 9866-9867, 9870-9876, 9891, 9895-9897, 9910, 9920, 9930-9931, 9940, 9945-9946, 9948, 9950, 9960-9964, 9970, 9975, 9980, 9982-9987, 9989)      Unknown and Ill-Defined Primary Sites (C42.0-C42.4, C76.0-C76.5, C76.7-C76.8, C77.0-C77.5, C77.8-C77.9, C80.9; Note: For C42.x and C77.x other than hematopoietic, reticuloendothelial, immunoproliferative and myeloproliferative neoplasms as listed above, Hodgkin and non-Hodgkin Lymphomas as listed above, and Kaposi sarcoma 9140/3)", 
        "table": {
            "00": [
                "All nodes examined are negative"
            ], 
            "01-89": [
                "1-89 nodes are positive. (Code exact number of nodes positive)"
            ], 
            "90": [
                "90 or more nodes are positive"
            ], 
            "95": [
                "Positive aspiration of lymph node(s) was performed"
            ], 
            "97": [
                "Positive nodes are documented, but the number is unspecified"
            ], 
            "98": [
                "No nodes were examined"
            ], 
            "99": [
                "It is unknown whether nodes are positive; not applicable; not stated in patient record"
            ]
        }, 
        "title": "Regional Lymph Nodes Positive"
    }, 
    {
        "NAACCR Item #": "830", 
        "allowable_values": "00 - 90, 95 - 99", 
        "analytical note": "This item became part of the Collaborative Stage Data Collection System when CS was implemented in 2004. The PUF item reflects data submitted at any time, regardless of the applicable manual.", 
        "category": "CANCER IDENTIFICATION", 
        "description": "Records the total number of regional lymph nodes that were removed and examined by the pathologist.   ", 
        "field_name": "REGIONAL_NODES_EXAMINED", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Only record information about regional lymph nodes in this data item.        This data item is based on pathology information only. If no lymph nodes were removed for examination, or if a lymph node drainage area was removed, but no lymph nodes were found, code 00.      Record the total number of regional lymph nodes removed and examined by the pathologist.      The number of regional lymph nodes examined is cumulative from all procedures that removed lymph nodes through the completion of surgeries during the first course of treatment.      Code 98 if lymph nodes are aspirated and other lymph nodes are removed.      This data item is to be recorded regardless of whether the patient received preoperative treatment.      If a lymph node biopsy was performed, code the number of nodes removed, if known.  If the number of nodes removed by biopsy is not known, code 96.      Code 99 for the following primary sites and histologies:       Placenta (C58.9)      Brain and Cerebral Meninges (C70.0, C71.0-C71.9)      Other Parts of Central Nervous System (C70.1, C70.9, C72.0-C72.5, C72.8-C72.9)      Hodgkin and non-Hodgkin Lymphoma (M-959-972) EXCEPT 9700/3 and 9701/3)      Hematopoietic, Reticuloendothelial, Immunoproliferative and Myeloproliferative Neoplasms (M-9731-9734, 9740-9742, 9750-9758, 9760-9762, 9764-9769, 9800-9801, 9805, 9820, 9823, 9826-827, 9831-9837, 9840, 9860-9861, 9863, 9866-9867, 9870-9876, 9891, 9895-9897, 9910, 9920, 9930-9931, 9940, 9945-9946, 9948, 9950, 9960-9964, 9970, 9975, 9980, 9982-9987, 9989)      Unknown and Ill-Defined Primary Sites (C42.0-C42.4, C76.0-C76.5, C76.7-C76.8, C77.0-C77.5, C77.8-C77.9, C80.9); Note: For C42.x and C77.x, other than hematopoietic, reticuloendothelial, immunoproliferative and myeloproliferative neoplasms as listed above, Hodgkin and non-Hodgkin Lymphomas as listed above, and Kaposi sarcoma 9140/3)", 
        "table": {
            "00": [
                "No nodes were examined"
            ], 
            "01-89": [
                "1-89 nodes were examined (Code the exact number of regional lymph nodes examined)"
            ], 
            "90": [
                "90 or more nodes were examined"
            ], 
            "95": [
                "No regional nodes were removed, but aspiration of regional nodes was performed"
            ], 
            "96": [
                "Regional lymph node removal was documented as a sampling, and the number of nodes is unknown/not stated"
            ], 
            "97": [
                "Regional lymph node removal was documented as a dissection, and the number of nodes is unknown/not stated"
            ], 
            "98": [
                "Regional lymph nodes surgically removed but number not documented, not documented as sampling or dissection"
            ], 
            "99": [
                "Unknown if regional nodes examined; not applicable for this site-histology combination"
            ]
        }, 
        "title": "Regional Lymph Nodes Examined"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": null, 
        "category": "Traditional AJCC Staging System", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date the surgical diagnostic and/or staging procedure was performed (NAACCR Item #1280).  This item is only available for diagnosis years 2003 and later.   ", 
        "field_name": "DX_STAGING_PROC_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0-999": [
                "Number of elapsed days"
            ], 
            "Blank": [
                "No surgical diagnostic and staging procedure, procedure unknown, elapsed days cannot be computed, or not available for these diagnosis years"
            ]
        }, 
        "title": "Diagnostic and Staging Procedure, Days from Dx"
    }, 
    {
        "NAACCR Item #": "1350", 
        "allowable_values": "00-07, 09", 
        "analytical note": "This item was added to FORDS in 2003, and is blank for earlier diagnoses in the PUF data.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Records the type of surgical diagnostic and/or staging procedure performed. ", 
        "field_name": "RX_SUMM_DXSTG_PROC", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Code the type of procedure performed as part of the initial diagnosis and workup, whether this is done at the reporting institution or another facility.      Code 02 is used if both an incisional biopsy of the primary site and an incisional biopsy of a metastatic site are done.      Surgical procedures which aspirate, biopsy, or remove regional lymph nodes in an effort to diagnose and/or stage disease are not coded in this item. The item Scope of Regional Lymph Node Surgery (NAACCR Item #1292) is used to code these procedures.      Brushings, washings, cell aspiration, and hematologic findings (peripheral blood smears) as positive cytologic diagnostic confirmation are coded in the data item Diagnostic Confirmation (NAACCR Item #490).  These are not considered surgical procedures and are not be coded in this item.      Excisional biopsies with clear or microscopic margins are not coded in this data item. Item Surgical Procedure of Primary Site (NAACCR Item #1290) is used to code these procedures.      Palliative surgical procedures are not coded in this data item. The item Palliative Procedure (NAACCR Item #3270) is used to code these procedures.", 
        "table": {
            "0": [
                "No surgical diagnostic or staging procedure was performed"
            ], 
            "1": [
                "A biopsy (incisional, needle, or aspiration) was done to a site other than the primary. No exploratory procedure was done"
            ], 
            "2": [
                "A biopsy (incisional, needle, or aspiration) was done to the primary site"
            ], 
            "3": [
                "A surgical exploration only. The patient was not biopsied or treated"
            ], 
            "4": [
                "A surgical procedure with a bypass was performed, but no biopsy was done"
            ], 
            "5": [
                "An exploratory procedure was performed, and a biopsy of either the primary site or another site was done"
            ], 
            "6": [
                "A bypass procedure was performed, and a biopsy of either the primary site or another site was done"
            ], 
            "7": [
                "A procedure was done, but the type of procedure is unknown"
            ], 
            "9": [
                "No information of whether a diagnostic or staging procedure was performed"
            ]
        }, 
        "title": "Diagnostic and Staging Procedure"
    }, 
    {
        "NAACCR Item #": "740", 
        "allowable_values": "00-07, 09", 
        "analytical note": null, 
        "category": "Traditional AJCC Staging System", 
        "description": "Records the type of surgical diagnostic and/or staging procedure performed at the reporting facility.   This data item was added to the 2015 PUF (data released in Fall 2017), and does not appear in prior versions of the PUF data. ", 
        "field_name": "RX_HOSP_DXSTG_PROC", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Code the type of procedure performed as part of the initial diagnosis and workup at the reporting institution.      Code 02 is used if both an incisional biopsy of the primary site and an incisional biopsy of a metastatic site are done.      Surgical procedures which aspirate, biopsy, or remove regional lymph nodes in an effort to diagnose and/or stage disease are not coded in this item. The item Scope of Regional Lymph Node Surgery (NAACCR Item #1292) is used to code these procedures.      Brushings, washings, cell aspiration, and hematologic findings (peripheral blood smears) as positive cytologic diagnostic confirmation are coded in the data item Diagnostic Confirmation (NAACCR Item #490).  These are not considered surgical procedures and are not be coded in this item.      Excisional biopsies with clear or microscopic margins are not coded in this data item. Item Surgical Procedure of Primary Site (NAACCR Item #1290) is used to code these procedures.      Palliative surgical procedures are not coded in this data item. The item Palliative Procedure (NAACCR Item #3270) is used to code these procedures.", 
        "table": {
            "0": [
                "No surgical diagnostic or staging procedure was performed"
            ], 
            "1": [
                "A biopsy (incisional, needle, or aspiration) was done to a site other than the primary. No exploratory procedure was done"
            ], 
            "2": [
                "A biopsy (incisional, needle, or aspiration) was done to the primary site"
            ], 
            "3": [
                "A surgical exploration only. The patient was not biopsied or treated"
            ], 
            "4": [
                "A surgical procedure with a bypass was performed, but no biopsy was done"
            ], 
            "5": [
                "An exploratory procedure was performed, and a biopsy of either the primary site or another site was done"
            ], 
            "6": [
                "A bypass procedure was performed, and a biopsy of either the primary site or another site was done"
            ], 
            "7": [
                "A procedure was done, but the type of procedure is unknown"
            ], 
            "9": [
                "No information of whether a diagnostic or staging procedure was performed"
            ]
        }, 
        "title": "Diagnostic and Staging Procedure at This Facility"
    }, 
    {
        "NAACCR Item #": "940", 
        "allowable_values": "Alphanumeric, Uppercase", 
        "analytical note": "For cases diagnosed on or prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item though the review of full range of clinical and patient notes available to registry staff.  For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging elements from a standardized document found in the patient record, as recorded by the managing physician. PUF users may notice an increase in the proportion of cases with cT reported as X as a consequence of the CoC restriction on the allowable range of registry coding of information beyond that documented by the managing physician.      The rules changed again with cases diagnosed in 2008.  Beginning with 2008 diagnoses, registrars were required to record clinical stage.  If it was not available from a physician, it was to be coded from information available in the patient record.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version occurred, and edition numbers are not included in the PUF for those older cases.       Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations. Starting with the 2015 PUF (released in Fall 2017), clinical T has been backward converted to include c prefixes.      There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the clinically-determined size and/or extension of the primary tumor (cT) as defined by the American Joint Committee on Cancer (AJCC).   ", 
        "field_name": "TNM_CLIN_T", 
        "format": null, 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the applicable AJCC Cancer Staging Manual for coding rules.", 
        "table": {
            "Blank": "Not available in patient record", 
            "c0": "cT0", 
            "c1": "cT1", 
            "c1A": "cT1a", 
            "c1A1": "cT1a1", 
            "c1A2": "cT1a2", 
            "c1B": "cT1b", 
            "c1B1": "cT1b1", 
            "c1B2": "cT1b2", 
            "c1C": "cT1c", 
            "c1D": "cT1d", 
            "c1MI": "cT1mic", 
            "c2": "cT2", 
            "c2A": "cT2a", 
            "c2A1": "cT2a1", 
            "c2A2": "cT2a2", 
            "c2B": "cT2b", 
            "c2C": "cT2c", 
            "c2D": "cT2d", 
            "c3": "cT3", 
            "c3A": "cT3a", 
            "c3B": "cT3b", 
            "c3C": "cT3c", 
            "c3D": "cT3d", 
            "c4": "cT4", 
            "c4A": "cT4a", 
            "c4B": "cT4b", 
            "c4C": "c4c", 
            "c4D": "c4d", 
            "c4E": "c4e", 
            "c88": "Not applicable", 
            "cA": "cTa", 
            "cX": "cTX", 
            "pIS": "pTis", 
            "pISPD": "pTispd", 
            "pISPU": "pTispu"
        }, 
        "title": "AJCC Clinical T"
    }, 
    {
        "NAACCR Item #": "950", 
        "allowable_values": "Alphanumeric, Uppercase", 
        "analytical note": "For cases diagnosed on or prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item though the review of full range of clinical and patient notes available to registry staff.  For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging elements from a standardized document found in the patient record, as recorded by the managing physician. PUF users may notice an increase in the proportion of cases with cN reported as X as a consequence of the CoC restriction on the allowable range of registry coding of information beyond that documented by the managing physician.      The rules changed again with cases diagnosed in 2008.  Beginning with 2008 diagnoses, registrars were required to record clinical stage.  If it was not available from a physician, it was to be coded from information available in the medical record.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version occurred, and edition numbers are not included in the PUF for those older cases.       Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations.Starting with the 2015 PUF (released in Fall 2017), clinical N has been backward converted to include c prefixes.      There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the clinically-determined absence or presence of regional lymph node (cN) metastasis and describes the extent of the regional lymph node metastasis as defined by the American Joint Committee on Cancer (AJCC).", 
        "field_name": "TNM_CLIN_N", 
        "format": null, 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the applicable AJCC Cancer Staging Manual for coding rules.", 
        "table": {
            "88": [
                "Not applicable"
            ], 
            "Blank": [
                "Not available in patient record"
            ], 
            "c0": [
                "cN0"
            ], 
            "c0A": [
                "cN0a"
            ], 
            "c0B": [
                "cN0b"
            ], 
            "c0I+": [
                "cN0i+"
            ], 
            "c0I-": [
                "cN0i-"
            ], 
            "c0M+": [
                "cN0m+"
            ], 
            "c0M-": [
                "cN0m-"
            ], 
            "c1": [
                "cN1"
            ], 
            "c1A": [
                "cN1a"
            ], 
            "c1B": [
                "cN1b"
            ], 
            "c1C": [
                "cN1c"
            ], 
            "c1MI": [
                "cN1mi"
            ], 
            "c2": [
                "cN2"
            ], 
            "c2A": [
                "cN2a"
            ], 
            "c2B": [
                "cN2b"
            ], 
            "c2C": [
                "cN2c"
            ], 
            "c3": [
                "cN3"
            ], 
            "c3A": [
                "cN3a"
            ], 
            "c3B": [
                "cN3b"
            ], 
            "c3C": [
                "cN3c"
            ], 
            "c4": [
                "cN4"
            ], 
            "cX": [
                "cNX"
            ]
        }, 
        "title": "AJCC Clinical N"
    }, 
    {
        "NAACCR Item #": "960", 
        "allowable_values": "Alphanumeric, Uppercase", 
        "analytical note": "For cases diagnosed on or prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item though the review of full range of clinical and patient notes available to registry staff.   For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging elements from a standardized document found in the patient record, as recorded by the managing physician. PUF users may notice an increase in the proportion of cases with cM reported as X as a consequence of the CoC restriction on the allowable range of registry coding of information beyond that documented by the managing physician.      The rules changed again with cases diagnosed in 2008.  Beginning with 2008 diagnoses, registrars were required to record clinical stage.  If it was not available from a physician, it was to be coded from information available in the medical record.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version occurred, and edition numbers are not included in the PUF for those older cases.      Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations. Starting with the 2015 PUF (released in Fall 2017), clinical M has been backward converted to include c prefixes.      There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the clinically-determined absence or presence of distant metastasis (cM) as defined by the American Joint Committee on Cancer (AJCC).   ", 
        "field_name": "TNM_CLIN_M", 
        "format": null, 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the applicable AJCC Cancer Staging Manual for coding rules in force for the particular edition.", 
        "table": {
            "88": [
                "Not appliable (not defined)"
            ], 
            "Blank": [
                "Not available in patient record."
            ], 
            "c0": [
                "cM0"
            ], 
            "c0I+": [
                "cM0(i+)"
            ], 
            "c1": [
                "cM1"
            ], 
            "c1A": [
                "cM1a"
            ], 
            "c1B": [
                "cM1b"
            ], 
            "c1C": [
                "cM1c"
            ], 
            "c1D": [
                "cM1d"
            ], 
            "cX": [
                "cMX"
            ]
        }, 
        "title": "AJCC Clinical M"
    }, 
    {
        "NAACCR Item #": "970", 
        "allowable_values": "Alphanumeric, Uppercase", 
        "analytical note": "For cases diagnosed on or prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item through the review of the full range of clinical and patient notes available to registry staff.  For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging items from a standardized document found in the patient record, as recorded by the managing physician.  PUF users may notice an increase in the proportion of 99s as a consequence of the CoC restriction on the allowable range of registry coding of information beyond that documented by the managing physician.      The rules changed again with cases diagnosed in 2008.  Beginning with 2008 diagnoses, registrars were required to record clinical stage.  If it was not available from a physician, it was to be coded from information available in the patient record.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version occurred, and edition numbers are not included in the PUF for those older cases.       Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations.       There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the applicable stage group based on the T, N, and M elements as defined by the American Joint Committee on Cancer (AJCC).   ", 
        "field_name": "TNM_CLIN_STAGE_GROUP", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the current AJCC Cancer Staging Manual for coding rules.", 
        "table": {
            "": "", 
            "0": "cStage 0", 
            "0A": "cStage 0A", 
            "0IS": "cStage 0is", 
            "1": "cStage I", 
            "1A": "cStage IA", 
            "1A1": "cStage IA1", 
            "1A2": "cStage IA2", 
            "1B": "cStage IB", 
            "1B1": "cStage IB1", 
            "1B2": "cStage IB2", 
            "1C": "cStage IC", 
            "2": "cStage II", 
            "2A": "cStage IIA", 
            "2A1": "cStage IIA1", 
            "2A2": "cStage IIA2", 
            "2B": "cStage IIB", 
            "2C": "cStage IIC", 
            "3": "cStage III", 
            "3A": "cStage IIIA", 
            "3B": "cStage IIIB", 
            "3C": "cStage IIIC", 
            "3C1": "cStage IIIC1", 
            "3C2": "cStage IIIC2", 
            "4": "cStage IV", 
            "4A": "cStage IVA", 
            "4A1": "cStage IVA1", 
            "4A2": "cStage IVA2", 
            "4B": "cStage IVB", 
            "4C": "cStage IVC", 
            "88": "Not applicable", 
            "99": "Unknown", 
            "IS": "cStage IS", 
            "OC": "Occult"
        }, 
        "title": "AJCC Clinical Stage Group"
    }, 
    {
        "NAACCR Item #": "880", 
        "allowable_values": null, 
        "analytical note": "For cases diagnosed on or prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item through the review of clinical and patient notes available to registry staff.  For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging elements from a standardized document found in the patient record, as recorded by the managing physician.        Beginning with 2008 diagnoses, the rules changed again.  Physicians were no longer required to stage, but cancer committees in CoC programs were required to devise plans to ascertain that staging was used appropriately to make treatment decisions.  Registries were encouraged to record physician staging when it was available, but were not required to do so.  The CoC determined that the stage groups derived from the Collaborative Stage Data Collection System met the criteria expected of pathologic staging, in providing an AJCC \"final stage\".  PUF users are likely to see a decrease in the completeness of pathologic staging recorded in the \"AJCC\" staging items in the years following 2008.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version occurred, and edition numbers are not included in the PUF for those older cases.       Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations. Starting with the 2015 PUF (released in Fall 2017), pathologic T has been backward converted to include p prefixes.      There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the pathologically-determined tumor size and/or extension (pT) as defined by the American Joint Committee on Cancer (AJCC).   ", 
        "field_name": "TNM_PATH_T", 
        "format": "Alphanumeric, Uppercase", 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the applicable AJCC Cancer Staging Manual for coding rules.", 
        "table": {
            "88": "Not applicable", 
            "Blank": "Not available in patient record (not collected 2008+)", 
            "p0": "pT0", 
            "p1": "pT1", 
            "p1A": "pT1a", 
            "p1A1": "pT1a1", 
            "p1A2": "pT1a2", 
            "p1B": "pT1b", 
            "p1B1": "pT1b1", 
            "p1B2": "pT1b2", 
            "p1C": "pT1c", 
            "p1D": "pT1d", 
            "p1MI": "pT1mic", 
            "p2": "pT2", 
            "p2A": "pT2a", 
            "p2A1": "pT2a1", 
            "p2A2": "pT2a2", 
            "p2B": "pT2b", 
            "p2C": "pT2c", 
            "p2D": "pT2d", 
            "p3": "pT3", 
            "p3A": "pT3a", 
            "p3B": "pT3b", 
            "p3C": "pT3c", 
            "p3D": "pT3d", 
            "p4": "pT4", 
            "p4A": "pT4a", 
            "p4B": "pT4b", 
            "p4C": "p4c", 
            "p4D": "p4d", 
            "p4E": "p4e", 
            "pA": "pTa", 
            "pIS": "pTis", 
            "pISPD": "pTispd", 
            "pISPU": "pTispu", 
            "pX": "pTX"
        }, 
        "title": "AJCC Pathologic T"
    }, 
    {
        "NAACCR Item #": "890", 
        "allowable_values": null, 
        "analytical note": "For cases diagnosed on or prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item though the review of full range of clinical and patient notes available to registry staff.  For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging elements from a standardized document found in the patient record, as recorded by the managing physician.        Beginning with 2008 diagnoses, the rules changed again.  Physicians were no longer required to stage, but cancer committees in CoC programs were required to devise plans to ascertain that staging was used appropriately to make treatment decisions.  Registries were encouraged to record physician staging when it was available, but were not required to do so.  The CoC determined tha the stage groups derived from the Collaborative Stage Data Collection System met the criteria expected of pathologic staging, in providing a AJCC \"final stage\".  PUF users are likely to see a decrease in the completeness of pathologic staging recorded in the \"AJCC\" staging items in the years following 2008.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version was allowed, such that some codes for cases diagnosed the year prior to implementation of a given edition and the year following its replacement may also have codes from the edition.      Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations. Starting with the 2015 PUF (released in Fall 2017), pathologic N has been backward converted to include p prefixes.      There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the pathologically-determined absence or presence or extent of regional lymph node (pN) metastasis as defined by the American Joint Committee on Cancer (AJCC).", 
        "field_name": "TNM_PATH_N", 
        "format": "Alphanumeric, Uppercase", 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the applicable AJCC Cancer Staging Manual for coding rules.", 
        "table": {
            "88": [
                "Not applicable"
            ], 
            "Blank": [
                "Not available in patient record. Not collected (2008+)"
            ], 
            "p0": [
                "pN0"
            ], 
            "p0A": [
                "pN0a"
            ], 
            "p0B": [
                "pN0b"
            ], 
            "p0I+": [
                "pN0i+"
            ], 
            "p0I-": [
                "pN0i-"
            ], 
            "p0M+": [
                "pN0m+"
            ], 
            "p0M-": [
                "pN0m-"
            ], 
            "p1": [
                "pN1"
            ], 
            "p1A": [
                "pN1a"
            ], 
            "p1B": [
                "pN1b"
            ], 
            "p1C": [
                "pN1c"
            ], 
            "p1MI": [
                "pN1mi"
            ], 
            "p2": [
                "pN2"
            ], 
            "p2A": [
                "pN2a"
            ], 
            "p2B": [
                "pN2b"
            ], 
            "p2C": [
                "pN2c"
            ], 
            "p3": [
                "pN3"
            ], 
            "p3A": [
                "pN3a"
            ], 
            "p3B": [
                "pN3b"
            ], 
            "p3C": [
                "pN3c"
            ], 
            "p4": [
                "pN4"
            ], 
            "pX": [
                "pNX"
            ]
        }, 
        "title": "AJCC Pathologic N"
    }, 
    {
        "NAACCR Item #": "900", 
        "allowable_values": "Alphanumeric, Uppercase", 
        "analytical note": "For cases diagnosed on or prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item though the review of full range of clinical and patient notes available to registry staff.  For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging elements from a standardized document found in the patient record, as recorded by the managing physician.        Beginning with 2008 diagnoses, the rules changed again.  Physicians were no longer required to stage, but cancer committees in CoC programs were required to devise plans to ascertain that staging was used appropriately to make treatment decisions.  Registries were encouraged to record physician staging when it was available, but were not required to do so.  The CoC determined that the stage groups derived from the Collaborative Stage Data Collection System met the criteria expected of pathologic staging, in  providing an AJCC \"final stage\".  PUF users are likely to see a decrease in the completeness of pathologic staging recorded in the \"AJCC\" staging items in the years following 2008.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version was allowed, such that some codes for cases diagnosed the year prior to implementation of a given edition and the year following its replacement may also have codes from the edition.      Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations. Starting with the 2015 PUF (released in Fall 2017), pathologic M has been backward converted to include p prefixes.      There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the pathologically-determined absence or presence of distant metastasis (pM) as defined by the American Joint Committee on Cancer (AJCC).   ", 
        "field_name": "TNM_PATH_M", 
        "format": null, 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the applicable AJCC Cancer Staging Manual for coding rules.", 
        "table": {
            "88": [
                "Not appliable (not defined)"
            ], 
            "Blank": [
                "Not available in patient record.     No positive pM. Not collected (2008+)"
            ], 
            "p0": [
                "pM0"
            ], 
            "p0I+": [
                "pM0(i+)"
            ], 
            "p1": [
                "pM1"
            ], 
            "p1A": [
                "pM1a"
            ], 
            "p1B": [
                "pM1b"
            ], 
            "p1C": [
                "pM1c"
            ], 
            "p1D": [
                "pM1d"
            ], 
            "pX": [
                "pMX"
            ]
        }, 
        "title": "AJCC Pathologic M"
    }, 
    {
        "NAACCR Item #": "910", 
        "allowable_values": "Alphanumeric, Uppercase", 
        "analytical note": "For cases diagnosed prior to December 31, 2003, this item was expected to be completed by an attending physician, though registry staff were frequently involved in the determination of the information coded in this item through the review of clinical and patient notes available to registry staff.  For cases diagnosed January 1, 2004, through December 31, 2007, the CoC required registries to copy the staging elements from a standardized document, as recorded by the managing physician.       Beginning with 2008 diagnoses, the rules changed again.  Physicians were no longer required to stage, but cancer committees in CoC cancer programs were required to devise plans to ascertain that staging was used appropriately to make treatment decisions.  Registries were encouraged to record physician staging when it was available, but were not required to do so.  The CoC determined that the stage groups derived from the Collaborative Stage Data Collection System met the criteria expected of pathologic staging, in providing an AJCC \"final stage\".  PUF users are likely to see a decrease in the completeness of pathologic staging in the \"AJCC' staging items in the years following 2008.      Cases are coded using the AJCC Cancer Staging Manual edition in use during the year in which the case was diagnosed.  Consult the appropriate edition of this manual for organ or site specific codes and their definitions.  See AJCC TNM Edition Number (NAACCR Item #1060).  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version was allowed, such that some codes for cases diagnosed the year prior to implementation of a given edition and the year following its replacement may also have codes from the edition.      Codes on this list comprise all codes valid for any AJCC manual through the 7th edition and for any chapter.  Please consult the applicable manual and chapter for codes that are valid for specific site, histology and AJCC edition combinations.      There is no standard mechanism to recode AJCC items from one edition to another.  Careful review of the individual definitions in the respective AJCC manuals is necessary before combining or comparing data across two or more AJCC editions.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the pathologically-determiend anatomic extent of disease based on the T, N, and M elements as defined by the American Joint Committee on Cancer (AJCC).   ", 
        "field_name": "TNM_PATH_STAGE_GROUP", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the applicable AJCC Cancer Staging Manual for coding rules.", 
        "table": {
            "0": "pStage 0", 
            "0A": "pStage 0A", 
            "0IS": "pStage 0is", 
            "1": "pStage I", 
            "1A": "pStage IA", 
            "1A1": "pStage IA1", 
            "1A2": "pStage IA2", 
            "1B": "pStage IB", 
            "1B1": "pStage IB1", 
            "1B2": "pStage IB2", 
            "1C": "pStage IC", 
            "2": "pStage II", 
            "2A": "pStage IIA", 
            "2A1": "pStage IIA1", 
            "2A2": "pStage IIA2", 
            "2B": "pStage IIB", 
            "2C": "pStage IIC", 
            "3": "pStage III", 
            "3A": "pStage IIIA", 
            "3B": "pStage IIIB", 
            "3C": "pStage IIIC", 
            "3C1": "pStage IIIC1", 
            "3C2": "pStage IIIC2", 
            "4": "pStage IV", 
            "4A": "pStage IVA", 
            "4A1": "pStage IVA1", 
            "4A2": "pStage IVA2", 
            "4B": "pStage IVB", 
            "4C": "pStage IVC", 
            "88": "Not applicable", 
            "99": "Unknown", 
            "Blank": "No pathologic staging for this case     (2008+ only)", 
            "IS": "pStage IS", 
            "OC": "Occult"
        }, 
        "title": "AJCC Pathologic Stage Group"
    }, 
    {
        "NAACCR Item #": "1060", 
        "allowable_values": "00-07, 88, 99", 
        "analytical note": "AJCC staging is coded according to the version of the AJCC Staging Manual in use at the time the case was diagnosed.  Prior to implementation of the 5th edition of the manual, some \"slippage\" in version occurred, and edition numbers are not included in the PUF for those older cases.", 
        "category": "Traditional AJCC Staging System", 
        "description": "Identifies the edition number of the AJCC Cancer Staging Manual used to stage the case.  ", 
        "field_name": "TNM_EDITION_NUMBER", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None; this item may be auto-coded by cancer registry software.", 
        "table": {
            "00": [
                "Not staged (cases that have AJCC staging scheme and staging was not done)"
            ], 
            "05": [
                "Fifth Edition"
            ], 
            "06": [
                "Sixth Edition"
            ], 
            "07": [
                "Seventh Edition"
            ], 
            "88": [
                "Not applicable (cases that do not have an AJCC staging scheme)"
            ], 
            "99": [
                "Staged, but the edition is unknown. Prior to the 5th edition"
            ]
        }, 
        "title": "TNM Edition Number"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0-5, 8, 9", 
        "analytical note": null, 
        "category": "Traditional AJCC Staging System", 
        "description": "Analytic Stage Group is assigned the value of reported Pathologic Stage Group.  Clinical Stage Group is used if pathologic stage is not reported.  Sub-stage groups are collapsed into the corresponding general stage designation.  The alphanumeric representation of stage group is provided for ease of display.   ", 
        "field_name": "ANALYTIC_STAGE_GROUP", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments:             <!--/*--><![CDATA[/* ><!--*/      table, th, td {border: 1px solid black; border-collapse: collapse;} th, td { padding: 5px;} th { text-align: left;}       /*--><!]]>*/             Code      Definition      0      Stage 0      1      Stage I      2      Stage II      3      Stage III      4      Stage IV      5      Occult (lung only)      8      AJCC Staging Not Applicable      9      AJCC Staging Unknown            ", 
        "registry_coding_instructions": "None.", 
        "table": {
            "0": [
                "Stage 0"
            ], 
            "1": [
                "Stage I"
            ], 
            "2": [
                "Stage II"
            ], 
            "3": [
                "Stage III"
            ], 
            "4": [
                "Stage IV"
            ], 
            "5": [
                "Occult (lung only)"
            ], 
            "8": [
                "AJCC Staging Not Applicable"
            ], 
            "9": [
                "AJCC Staging Unknown"
            ]
        }, 
        "title": "NCDB Analytic Stage Group"
    }, 
    {
        "NAACCR Item #": "2810", 
        "allowable_values": null, 
        "analytical note": "CS Extension is part of the Collaborative Stage Data Collection System (CS), and was implemented in 2004.  It is used to derive some AJCC T-values and some SEER Summary Stage codes.       Some detective work is required to interpret codes in the CS Extension field.  The codes differ by type of cancer and by the version of CS in which the case was coded.  In the PUF, CS fields are retained in the form in which they were submitted.  That means that it will be necessary to identify the CS Version Numbers that are used in the PUF file, and use those to identify whether the contents of the CS Extension field may have changed over time.  Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Identifies contiguous growth (extension) of the primary tumor within the organ or origin or its direct extension into neighboring organs.  For some sites such as ovary, discontinuous metastasis is coded in CS Extension.", 
        "field_name": "CS_EXTENSION", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "CS Extension"
    }, 
    {
        "NAACCR Item #": "2820", 
        "allowable_values": null, 
        "analytical note": "CS Tumor Size/Ext Eval is part of the Collaborative Stage Data Collection System (CS), and was implemented in 2004.  It is used to describe whether the staging basis for the AJCC T value is clinical or pathologic and to record whether systemic treatment was performed prior to assignment of either CS Tumor Size or CS Extension codes.      Some detective work is required to interpret codes in the CS Tumor Size/Ext field.  The codes differ by type of cancer and occasionally by the version of CS in which the case was coded.  In the PUF, CS fields are retained in the form in which they were submitted.  That means that it will be necessary to identify the CS Version Numbers that are used in the PUF file, and to use those to identify whether the contents of the CS Tumor Size/Ext Eval fields may have changed over time.  Links to the site-specific codes can be found athttp://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Records how the codes for the two items, CS Tumor Size and CS Extension were determined, based on the diagnostic methods employed.", 
        "field_name": "CS_TUMOR_SIZEEXT_EVAL", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "CS TS/Ext Eval"
    }, 
    {
        "NAACCR Item #": "1182", 
        "allowable_values": "0-1, 8-9", 
        "analytical note": "This data item was not collected for cases diagnosed prior to 2010. Due to delays in some hospitals for implementing registry data updates, it may be incomplete for 2010 cases.       Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Indicates the presence or absence of tumor cells in lymphatic channels (not lymph nodes) or blood vessels within the primary tumor as noted microscopically by the pathologist.  This data item is separate from the CS data items but is included in this manual because of its relationship to the Collaborative Stage Data Collection System.  Lymph-vascular invasion is an item of interest to both pathologists and clinicians and is mentioned in many chapters of the AJCC Cancer Staging Manual, seventh edition.   This field is required for mapping of T in some sites, such as testis and penis.  ", 
        "field_name": "LYMPH_VASCULAR_INVASION", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = Lymph-vascular invasion is not present (absent) or not identified      1 = Lymph-vascular invasion is present or identified      8 = Not applicable      9 = Unknown if lymph-vascular invasion is present, or indeterminant      ", 
        "registry_coding_instructions": "Code from pathology report(s). Code the absence or presence of lymph-vascular invasion as described in the medical record.      The primary sources of information about lymph-vascular invasion are the pathology check lists (synoptic reports) developed by the College of American Pathologists. If the case does not have a checklist or synoptic report, code from the pathology report or a physician's statement, in that order.       Do not code perineural invasion in this field.       Information to code this field can be taken from any specimen from the primary tumor.       If lymph-vascular invasion is identified anywhere in the resected specimen, it should be coded as present/identified.       Use of codes       Use code 0 when the pathology report indicates that there is no lymph-vascular invasion. This includes cases of purely in situ carcinoma, which biologically have no access to lymphatic or vascular channels below the basement membrane.       Use code 1 when the pathology report or a physician's statement indicates that lymph-vascular invasion (or one of its synonyms) is present in the specimen.       Use code 8 for the following primary sites: Hodgkin and Non-Hodgkin lymphoma, Leukemias, Hematopoietic and reticuloendothelial disorders, Myelodysplastic syndromes including refractory anemias and refractory cytopenias, Myeloproliferative disorders      Use code 9 when       there is no microscopic examination of a primary tissue specimen       the primary site specimen is cytology only or a fine needle aspiration       the biopsy is only a very small tissue sample       it is not possible to determine whether lymph-vascular invasion is present       the pathologist indicates the specimen is insufficient to determine lymph-vascular invasion       lymph-vascular invasion is not mentioned in the pathology report", 
        "table": {}, 
        "title": "Lymph-vascular Invasion"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": null, 
        "analytical note": "CS Mets at Dx is part of the Collaborative Stage Data Collection System (CS), and was first introduced in 2004.  It is used to derive some AJCC M values and SEER Summary Stage codes.      Some detective work is required to interpret codes in the CS Mets at Dx field.  The codes differ by type of cancer and by the version of CS in which the case was coded.  In the PUF, CS fields are retained in the form in which they were submitted.  That means that it will be necessary to identify the CS Version Numbers that are used in the PUF file, and use those to identify whether the contents of the CS Mets at Dx filed may have change dover time.  Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Identifies whether there is metastatic involvement of distant site(s) at the time of diagnosis.", 
        "field_name": "CS_METS_AT_DX", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "CS Mets at DX"
    }, 
    {
        "NAACCR Item #": "2851", 
        "allowable_values": "0, 1, 8, 9", 
        "analytical note": "This item was first collected in 2010. Because of delays in some hospitals in implementing registry software updates, data may be incomplete for 2010 diagnoses.       Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Identifies the presence of distant metastatic involvement of bone at the time of diagnosis.", 
        "field_name": "CS_METS_DX_BONE", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = None; no bone metastases      1 = Yes      8 = Not applicable      9 = Unknown whether bone is involved; Not documented in patient record      ", 
        "registry_coding_instructions": "Code information about bone metastases only (discontinuous or distant metastases to bone) identified at the time of diangosis.  This field should not be coded for bone marrow involvement.      Bone involvement may be single or multiple.      Information about bone involvement may be clinical or pathologic.      Code this field whether or not the patient had any preoperative systemic therapy.      This field should be coded for all solid tumors, Kaposi sarcoma, Unknown Primary Site, and Other and Ill-Defined Sites.      Use code 8 for Hematopoietic, reticuloendothelial, Immunopolifereative and Myeloproliferative Neoplasms, and Hodgkin and non-Hodgkin Lymphoma.      Use code 9 when it cannot be determined from the medical record whether the patient specifically had bone metastases; for example, when CS Mets at DX is coded as carcinomatosis but bone is not specifically mentioned as a metastatic site.  Also use code 9 when it is not known whether the patient had any distant metastases.", 
        "table": {}, 
        "title": "CS Mets at DX-Bone"
    }, 
    {
        "NAACCR Item #": "2852", 
        "allowable_values": "0, 1, 8, 9", 
        "analytical note": "This item was first collected in 2010.  Because of delays in some hospitals in implementing registry software updates, data may be incomplete for 2010 diagnoses.       Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Identifies the presence of distant metastatic involvement of the brain at the time of diagnosis.", 
        "field_name": "CS_METS_DX_BRAIN", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = None; no brain metastases      1 = Yes      8 = Not applicable      9 = Unknown whether the brain is involved; Not documented in patient record      ", 
        "registry_coding_instructions": "Code information about brain metastases only (discontinuous or distant metastases to brain) known at the time of diagnosis.  This field should not be coded for involvement of the spinal cord or other parts of the central nervous system.             Brain involvement may be single or multiple.             Information about brain involvement may be clinical or pathologic.             Code this fields whether or not the patient had any preoperative systemic therapy.             This field should be coded for all solid tumors, Kaposi sarcoma, Unknown Primary Site, and Other and Ill-Defined Primary Sites.             Use code 8 for Hematopoietic, Reticuloendothelial, Immunoproliferative aned Myeloproliferative Neoplasms, and Hodgkin and non-Hodgkin Lymphoma.             Use code 9 when it cannot be determined from the medical record whether the patient specifically had brain metastases; for example, when CS Mets at DX is coded as carcinomatosis but the brain is not specifically mentioned as a metastatic site.  Also use code 9 when it is not known whether the patient had any distant metastases.", 
        "table": {}, 
        "title": "CS Mets at DX-Brain"
    }, 
    {
        "NAACCR Item #": "2853", 
        "allowable_values": "0, 1, 8, 9", 
        "analytical note": "This item was first collected in 2010. Because of delays in some hospitals in implementing registry software updates, data may be incomplete for 2010 diagnoses.       Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Identifies the presence of distant metastatic involvement of the liver at the time of diagnosis.", 
        "field_name": "CS_METS_DX_LIVER", 
        "format": "String", 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = None; no liver metastases      1 = Yes      8 = Not applicable      9 = Unknown whether the liver is involved; Not documented in patient record.      ", 
        "registry_coding_instructions": "Code information about liver metastases only (discontinuous or distant metastases to the liver) identified at the time of diagnosis.      Liver involvement may be single or multiple.      Information about liver involvement may be clinical or pathologic.      Code this field whether or not the patient had any preoperative systemic therapy.      This field should be coded for all solid tumors, Kaposi sarcoma, Unknown Primary Site, and Other and Ill-Defined Sites.      Use code 8 for Hematopoietic, Reticuloendothelial, Immunoproliferative and Myeloproliferative Neoplasms, and Hodgkin and non-Hodgkin Lymphoma.      Use code 9 when it cannot be determined from the medical record whether the patient had liver metastases; for example, when CS Mets at DX is coded as carcinomatosis but the liver is nto specifically mentioned as a metastatic site.  Also use code 9 when it is not known whehtehr the patient had any distant metastases.", 
        "table": {}, 
        "title": "CS Mets at DX-Liver"
    }, 
    {
        "NAACCR Item #": "2854", 
        "allowable_values": "0, 1, 8, 9", 
        "analytical note": "This item was first collected in 2010. Because of delays in some hospitals in implementing registry software updates, data may be incomplete for 2010.       Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Identifies the presence of distant metastatic involvement of the lung at the time of diagnosis.", 
        "field_name": "CS_METS_DX_LUNG", 
        "format": "String", 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = None; no lung metastases      1 = Yes      8 = Not applicable      9 =Unknown whether the lung is involved; Not documented in patient record      ", 
        "registry_coding_instructions": "Code information about lung metastases only (discontinuous or distant metastases to the lung) identified at the time of diagnosis.  This field should not be coded for pleural or pleural fluid involvement.      Lung involvement may be single or multiple.      Information about lung involvement may be clinical or pathologic.      Code this field whether or not the patient had any preoperative systemic therapy.      This field should be coded for all solid tumors, Kaposi sarcoma, Unknown Primary Site, and Other and Ill-Defined Primary Sites.      Use code 8 for Hematopoietic, Reticuloendothelial, Immunoproliferative and Myeloproliferative Neoplasms, and Hodgkin and non-Hodgkin Lymphoma.      Use code 9 when it cannot be determined from the medical record whether the patient specifically had lung metastases; for example, when CS Mets at Dx is coded as carcinomatosis but the lung is not specifically mentioned as a meatastatic site.  Also use code 9 when it is not known whether the patient had any distant metastases.", 
        "table": {}, 
        "title": "CS Mets at DX-Lung"
    }, 
    {
        "NAACCR Item #": "2861- 2880, 2890, 2900, 2910, 2920, 2930 ", 
        "allowable_values": "000-999", 
        "analytical note": "Using the Site Specific Factors from the Collaborative Stage Data Collection System      Several PUF projects will examine one or more laboratory prognostic indicators.  These are available as Site Specific Factors (SSF) collected as part of the Collaborative Stage Data Collection System (CS).  The term \"collaborative\" means that the data collection tool was devised to meet the various needs of cancer registry data standard setters such as the Commission on Cancer (CoC), Surveillance Epidemiology and End Results (SEER), and the National Program of Cancer Registries (NPCR).       Up to 25 data fields are used to collect SSFs.  Being site specific, they contain different information depending on the type of cancer in the report.  For example, for breast cancer reports SSF1 contains \"Estrogen Receptor (ER) Assay\" results, but for colon cancer reports SSF1 contains \"Carcinoembryonic Antigen (CEA)\" results.       SSFs also may convey non-laboratory site specific information that is relevant to prognosis for some cases.  For example, SSF1 for gastric cancers is \"Clinical Assessment of Regional Lymph Nodes\", and for melanoma of skin it is \"Measured Thickness (Depth), Breslow Measurement\".      Some detective work is required to identify the data fields of interest, the applicable codes, and the adequacy of the data for the particular study.       The codes, and occasionally the fields used, for a particular prognostic factor changed over time.  In the PUF the SSF data are retained in the form in which they were submitted. That means that it will be necessary to identify the CS Version Numbers that are used in the PUF file, and use those to identify whether the data contents for the desired SSF may have changed or moved over time.  Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.        The quality of the SSF data items has undergone minimal review by NCDB, and PUF users are advised to examine the data consistency and completeness of these items carefully before proceeding with the study.       All SSF data items are edited for validity and internal consistency before the case report is submitted, and the submitter is required to correct any edit errors.  However, some coding errors remain.        Case coverage of the SSFs is limited for a variety of reasons, potentially seriously affecting their applicability for some studies.       The availability of the measures to hospital registrars at the time of data entry is sparse for many prognostic measures.  The source of information is usually the laboratory report as it appears in the hospital patient record.  The information may not be available in the hospital if it was requested by a physician and the report was sent to the physician's office.  Or it may be delayed and not picked up later.      The individual tests are not run at all locations or for all patients, even if the test is part of an acknowledged treatment protocol.       Finally, many hospital registries began abstracting data for the years the measures were introduced prior to the hospital's upgrade of the software necessary to collect those items, and they did not necessarily return to the cases to abstract the missed data.  No SSFs are available for cases diagnosed prior to 2004.  Some of the items were first introduced in 2004, and are underrepresented for cases diagnosed that year compared to later years.  Most prognostic SSFs were introduced in 2010, and are certainly underrepresented for 2010 diagnoses; they are not available at all for earlier years.      The SSFs in use in for Versions 2.02 through the current version and whether the field was required for CoC registries are described in http://seer.cancer.gov/csreqstatus/index.html.   To access the list of Site-Specific Factors required by the Commission on Cancer, click the \"Get Started\" button in the Collaborate Stage Requirements Status box on the right-hand side of the page. Then, press the plus sign in the middle of the page, select \"Required Factors\" as Report, \"CoC\" as the Standard Setter, and the applicable version under Version. As noted above, the fields in which these items were stored and the codes used may have changed over time.      Please direct questions about the use of SSFs to NCDB_PUF@facs.org.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "The CS Site Specific Factors are part of the Collaborative Stage Data Collection System, which was implemented in 2004 and expanded in 2010. CS Site Specific Factors 1-24, when used for a particular site, contain information that is used to assign AJCC 6th and/or 7th edition T, N, M and stage group, or prognostic information identified in the AJCC Cancer Staging Manual, 7th edition. CS Site Specific Factor 25 is used to distinguish between or among staging schema when site and histology codes are not sufficient, for consistency with the AJCC 7th edition for the following: Nasopharynx/ Pharyngeal Tonsil; Esophagus GE Junction / Stomach; Bile Ducts Distal / Bile Ducts Perihilar / Cystic Duct; Peritoneum / Peritoneum Female Genital; Melanoma Ciliary Body / Melanoma Iris; Lacrimal Gland / Lacrimal Sac.", 
        "field_name": "CS_SITESPECIFIC_FACTOR_1 through CS_SITESPECIFIC_FACTOR_25", 
        "format": null, 
        "length": "3", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "CS Site Specific Factors 1-25"
    }, 
    {
        "NAACCR Item #": "2860", 
        "allowable_values": null, 
        "analytical note": "CS Mets Eval is part of the Collaborative Stage Data Collection System (CS), and was implemented in 2004.  It describes whether the staging basis for CS Mets at Dx was clinical or pathologic, and whether any systemic treatment was given prior to that code assignment.      Some detective work is required to interpret codes in CS Mets Eval.  The codes may differ by type of cancer and by the version of CS in which the case was coded.  In the PUF, CS fields are retained in the form in which they are submitted.  That means that it will be necessary to identify the CS Version Numbers that are used in the PUF file, and use those to identify whether the contents of the CS Mets Eval field may have changed over time.  Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Records how the code for CS Mets at DX was determined based on the diagnostic methods employed.", 
        "field_name": "CS_METS_EVAL", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "CS Mets Eval"
    }, 
    {
        "NAACCR Item #": "2800", 
        "allowable_values": "000 - 995, 999", 
        "analytical note": "This field is blank in the Melanoma of the Skin PUF. Use CS Site Specific Factor #1 to obtain Breslow's depth. CS Tumor Size is part of the Collaborative Stage Data Collection System (CS), and was implemented in 2004. It is used to describe tumor size at diagnosis as an independent prognostic indicator for many tumors and it is used by Collaborative Stage to derive some TNM-T codes. Links to the site-specific codes can be found at http://ncdbpuf.facs.org/?q=node/370.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "Describes the largest dimension of the diameter of the primary tumor in millimeters (mm).", 
        "field_name": "TUMOR_SIZE", 
        "format": null, 
        "length": "3", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Refer to the site and histology-specific instructions in the current CS manual for coding instructions. CoC does not require that registrars report information for this item that is not readily available in the facility's records. However, if that information is obtained along with other material from another source, it may be used.", 
        "table": {}, 
        "title": "Size of Tumor"
    }, 
    {
        "NAACCR Item #": "2936", 
        "allowable_values": null, 
        "analytical note": "This item is a 6-digit code. The first two digits represent the major version number; the second two digits represent minor version changes; and the last two digits represent even less significant changes (from correction of spelling errors to tracking of conversion processes). Use the codes listed above to interpret contents of CS Site-Specific items. See http://ncdbpuf.facs.org/?q=node/370 for the links to respective site-specific schema.", 
        "category": "Collaborative Stage Data Collection System", 
        "description": "This is the version number of the most recent derivation of CS data items in the record.", 
        "field_name": "CS_VERSION_LATEST", 
        "format": null, 
        "length": "6", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: The following are the allowable codes (XX stands for \"any two digits\"):      CSv01      0009XX (this was a trial version, consider the same as 0101XX)      0101XX      0102XX      0103XX      0104XX      CSv02      0200XX      0201XX      0202XX      0203XX      0204XX      0205XX      ", 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "CS Version Number"
    }, 
    {
        "NAACCR Item #": "1285", 
        "allowable_values": "0-2, 9", 
        "analytical note": "This item is only reported for diagnosis years 2010 and later.", 
        "category": "TREATMENT", 
        "description": "This item summarizes whether the patient received any treatment or was under active surveillance.", 
        "field_name": "RX_SUMM_TREATMENT_STATUS", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Treatment after a period of active surveillance is considered subsequent treatment and is not coded in this item.      Use code 0 when treatment is refused or the physician decides not to treat for any reason such as the presence of comorbidities.", 
        "table": {
            "0": [
                "No treatment given"
            ], 
            "1": [
                "Treatment given"
            ], 
            "2": [
                "Active surveillance (watchful waiting)"
            ], 
            "9": [
                "Unknown if treatment given"
            ]
        }, 
        "title": "Treatment Status"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": " 0 - 9999", 
        "analytical note": null, 
        "category": "TREATMENT", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which treatment [surgery, radiation, systemic, or other therapy] (NAACCR Item #1270) of the patient began at any facility.   ", 
        "field_name": "DX_RX_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "No first course therapy administered, first course therapy unknown, or cannot compute days elapsed due to missing or incomplete dates"
            ]
        }, 
        "title": "Treatment Started, Days from Dx"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources. Surgical treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file. This refers to the first surgical procedure for the cancer by any facility.", 
        "category": "Surgery", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date the first treatment surgery was performed (NAACCR Item #1200).  The surgery may be primary site surgery (NAACCR Item #1290), regional lymph node surgery (NAACCR Item #1292) or other regional or distant surgery (NAACCR Item #1294). Incisional biopsies are not coded as treatment surgery.", 
        "field_name": "DX_SURG_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "No first course surgery, first course surgery unknown, or cannot compute days elapsed due to missing or incomplete dates"
            ]
        }, 
        "title": "First Surgical Procedure, Days from Dx"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": "The Date of the Most Definitive Surgical Procedure of the Primary Site was added to FORDS in 2003, so this item is not defined prior to that year.  It refers to the last date that first course surgery of the primary site was performed for the patient.  For example, a breast cancer patient may have been treated with an excisional biopsy, followed by a lumpectomy, followed by a mastectomy.  This item identifies the time period between the Date of Initial Diagnosis and the date of the mastectomy.  The Surgical Procedure of the Primary Site will record the mastectomy.      CoC cancer programs are required to identify treatment their patients received from all sources.  Surgical treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.  This refers to the final surgery of the primary site, cumulative for all procedures, for the cancer by any facility.", 
        "category": "Surgery", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which the most definitive surgical procedure was performed on the primary site (NAACCR Item #3170).", 
        "field_name": "DX_DEFSURG_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "No first course surgery, surgery unknown, or cannot compute days elapsed due to incomplete or missing dates"
            ]
        }, 
        "title": "Definitive Surgical Procedure, Days from Dx"
    }, 
    {
        "NAACCR Item #": "1290", 
        "allowable_values": "00, 10-80, 90, 98, 99", 
        "analytical note": "If multiple first course surgeries are performed on the primary site, the code represents the cumulative effect of all primary site surgeries.  For example, if a breast cancer patient is treated with an excisional biopsy, then a lumpectomy, then a mastectomy, the mastectomy is coded in this field.  The date of the mastectomy is represented in DX_DEFSURG_STARTED_DAYS.       CoC cancer programs are required to identify treatment their patients received from all sources.  Surgical treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.  This refers to the final surgery of the primary site, cumulative for all procedures, for the cancer by any facility.       Descriptions of surgical codes have been revised over time. Please refer to the versions of FORDS corresponding to the diagnosis years covered in your analyses to find out whether any changes have occurred in your primary site(s) of interest in your study. All versions of FORDS may be accessed via the following link: https://www.facs.org/quality-programs/cancer/ncdb/registrymanuals/cocman....       The site-specific surgical codes may be found in the Surgery of the Primary Site Codes data dictionary entry.", 
        "category": "Surgery", 
        "description": "Records the surgical procedure performed to the primary site at any facility. ", 
        "field_name": "RX_SUMM_SURG_PRIM_SITE", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Site-specific codes for this data item are found in Surgery of the Primary Site Codes.      If registry software allows only one procedure to be collected, document the most invasive surgical procedure for the primary site.      If registry software allows multiple procedures to be recorded, this item refers to the most invasive surgical procedure of the primary site.      For codes 00 through 79, the response positions are hierarchical by position (not necessarily numerically). Last-listed responses take precedence over responses written above. Code 98 takes precedence over code 00. Use codes 80 and 90 only if more precise information about the surgery is not available.      Biopsies that remove all of the tumor and/or leave only microscopic margins are to be coded in this item.      Surgery to remove regional tissue or organs is coded in this item only if the tissue/organs are removed in continuity with the primary site, except where noted in the site-specific Surgery of the Primary Site Codes.      If a previous surgical procedure to remove a portion of the primary site is followed by surgery to remove the remainder of the primary site, then code the total or final results.      If the procedure coded in this item was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record this surgery in the item Palliative Care (NAACCR Item #3270).", 
        "table": {
            "00": [
                "Site-specific codes; tumor destruction", 
                "No surgical procedure of primary site. Diagnosed at autopsy."
            ], 
            "10-19": [
                "Site-specific codes; tumor destruction", 
                "Tumor destruction, no pathologic specimen produced. Refer to Surgery of the Primary Site Codes for the correct site-specific code for the procedure."
            ], 
            "20-80": [
                "Site-specific codes; resection", 
                "Refer to Surgery of the Primary Site Codes for the correct site-specific code for the procedure."
            ], 
            "90": [
                "Site-specific codes; special", 
                "Special code. Refer to Surgery of the Primary Site Codes for the correct site-specific code for the procedure."
            ], 
            "99": [
                "Unknown", 
                "Patient record does not state whether a surgical procedure of the primary site was performed and no information is available. Death certificate only."
            ]
        }, 
        "title": "Surgical Procedure of the Primary Site"
    }, 
    {
        "NAACCR Item #": "670", 
        "allowable_values": "00, 10-80, 90, 98, 99", 
        "analytical note": "If multiple first course surgeries are performed on the primary site, the code represents the cumulative effect of all primary site surgeries. For example, if a breast cancer patient is treated with an excisional biopsy, then a lumpectomy, then a mastectomy, the mastectomy is coded in this field. The date of the mastectomy is represented in DX_DEFSURG_STARTED_DAYS.      CoC cancer programs are required to identify treatment their patients received from all sources.  Surgical treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.  This refers to the final surgery of the primary site, cumulative for all procedures, for the cancer by the reporting facility. Additional surgery, or prior surgery, may have been performed elsewhere.  The item RX_SUMM_SURG_PRIM_SITE describes the cumulative primary site surgery performed on the patient at any facility.      Descriptions of surgical codes have been revised over time. Please refer to the versions of FORDS corresponding to the diagnosis years covered in your analyses to find out whether any changes have occurred in your primary site(s) of interest in your study. All versions of FORDS may be accessed via the following link: https://www.facs.org/quality-programs/cancer/ncdb/registrymanuals/cocman....       The site-specific surgical codes may be found in the  Surgery of the Primary Site Codes data dictionary entry.", 
        "category": "Surgery", 
        "description": "This item records the surgical procedure performed to the primary site at the facility that submitted this record.", 
        "field_name": "RX_HOSP_SURG_PRIM_SITE", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Site-specific codes for this data item are found in Surgery of the Primary Site Codes.      If registry software allows only one procedure to be collected, document the most invasive surgical procedure for the primary site.      If registry software allows multiple procedures to be recorded, this item refers to the most invasive surgical procedure of the primary site.      For codes 00 through 79, the response positions are hierarchical by position (not necessarily numerically). Last-listed responses take precedence over responses written above. Code 98 takes precedence over code 00. Use codes 80 and 90 only if more precise information about the surgery is not available.      Biopsies that remove all of the tumor and/or leave only microscopic margins are to be coded in this item.      Surgery to remove regional tissue or organs is coded in this item only if the tissue/organs are removed in continuity with the primary site, except where noted in the site-specific Surgery of the Primary Site Codes.      If a previous surgical procedure to remove a portion of the primary site is followed by surgery to remove the remainder of the primary site, then code the total or final results.", 
        "table": {
            "00": [
                "Site-specific codes; tumor destruction", 
                "No surgical procedure of primary site. Diagnosed at autopsy."
            ], 
            "10-19": [
                "Site-specific codes; tumor destruction", 
                "Tumor destruction, no pathologic specimen produced. Refer to Surgery of the Primary Site Codes for the correct site-specific code for the procedure."
            ], 
            "20-80": [
                "Site-specific codes; resection", 
                "Refer to Surgery of the Primary Site Codes for the correct site-specific code for the procedure."
            ], 
            "90": [
                "Site-specific codes; special", 
                "Special code. Refer to Surgery of the Primary Site Codes for the correct site-specific code for the procedure."
            ], 
            "99": [
                "Unknown", 
                "Patient record does not state whether a surgical procedure of the primary site was performed and no information is available. Death certificate only."
            ]
        }, 
        "title": "Surgery at This Facility"
    }, 
    {
        "NAACCR Item #": "668", 
        "allowable_values": "0 - 5, 9", 
        "analytical note": "This item was first used for 2010 diagnoses.", 
        "category": "Surgery", 
        "description": "This item is used to monitor patterns and trends in the adoption and utilization of minimally-invasive surgical techniques.", 
        "field_name": "RX_HOSP_SURG_APPR_2010", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "This item may be left blank for cases diagnosed prior to 2010.      If the patient has multiple surgeries of the primary site, this item describes the approach used for the most invasive, definitive surgery.      For ablation of skin tumors, assign code 3.      Assign code 2 or 4 if the surgery began as robotic assisted or endoscopic and was converted to open.      If both robotic and endoscopic or laparoscopic surgery are used, code to robotic (codes 1 or 2).", 
        "table": {
            "0": [
                "No surgical procedure of primary site at this facility"
            ], 
            "1": [
                "Robotic assisted"
            ], 
            "2": [
                "Robotic converted to open"
            ], 
            "3": [
                "Endoscopic or laparoscopic"
            ], 
            "4": [
                "Endoscopic or laparoscopic converted to open"
            ], 
            "5": [
                "Open or approach unspecified"
            ], 
            "9": [
                "Unknown whether surgery was performed at this facility"
            ]
        }, 
        "title": "Surgical Approach"
    }, 
    {
        "NAACCR Item #": "1320", 
        "allowable_values": " 0-3, 7-9", 
        "analytical note": null, 
        "category": "Surgery", 
        "description": "Records the final status of the surgical margins after resection of the primary tumor.   ", 
        "field_name": "RX_SUMM_SURGICAL_MARGINS", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Record the margin status as it appears in the pathology report.      Codes 0-3 are hierarchical; if two codes describe the margin status, use the numerically higher code.      If no surgery of the primary site was performed, code 8.      For lymphomas with a lymph node primary site (C77.0-C77.9), code 9.      For an unknown or ill-defined primary (C76.0-C76.8, C80.9) or for hematopoietic, reticuloendothelial, immunoproliferative, or myeloproliferative disease, code 9.      For Brain and CNS sites, the NCDB converts codes 0, 1, 2, 3, and 7 to code 9 for this item due to unreliability.", 
        "table": {
            "0": [
                "No residual tumor", 
                "All margins are grossly and microscopically negative."
            ], 
            "1": [
                "Residual tumor, NOS", 
                "Involvement is indicated, but not otherwise specified."
            ], 
            "2": [
                "Microscopic residual tumor", 
                "Cannot be seen by the naked eye."
            ], 
            "3": [
                "Macroscopic residual tumor", 
                "Gross tumor of the primary site which is visible to the naked eye."
            ], 
            "7": [
                "Margins not evaluable", 
                "Cannot be assessed (indeterminate)."
            ], 
            "8": [
                "No primary site surgery", 
                "No surgical procedure of the primary site. Diagnosed at autopsy."
            ], 
            "9": [
                "Unknown or not applicable", 
                "It is unknown whether a surgical procedure to the primary site was performed; death certificate-only; for lymphomas with a lymph node primary site; an unknown or ill-defined primary; or for hematopoietic, reticuloendothelial, immunoproliferative, or myeloproliferative disease."
            ]
        }, 
        "title": "Surgical Margins"
    }, 
    {
        "NAACCR Item #": "1292", 
        "allowable_values": "0-1, 9", 
        "analytical note": "This item was reported as a site-specific item under the ROADS manual for diagnosis years 1998 - 2002. Those cases were converted to FORDS form by NCDB.  For cases diagnosed on or after January 1, 2003, the scope of regional lymph node surgery is no longer specific to the organ of origin.      Sentinel Lymph Nodes:  Data on Scope of Regional Lymph Node Surgery have been found to under-report Sentinel Lymph Node Biopsy (SLNBx) procedures either alone or with Axillary Dissection (ALND). Reviews by the Commission on Cancer (CoC), the Centers for Disease Control and Prevention's National Program of Cancer Registries (CDC/NPCR), and the National Cancer Institute's Surveillance, Epidemiology, and End Results (SEER) Program (NCI SEER) all confirmed mis-coding of this data element. Revised coding rules and associated instructions were developed that put emphasis on securing information from the operative report in contrast to the pathology report. These revised coding instructions were implemented for cases diagnosed January 1, 2012 and later. All population based and facility based cancer registry programs are coordinating implementation through shared materials, communications, training, and quality assessments. Therefore, CoC use of the item \"Scope of Regional Lymph Node Surgery\" is curtailed in all data years prior to 2012 contained in the PUF. The item is used only to identify whether or not a patient underwent regional lymph node surgery, effectively removing any distinction between the type or extent of surgical intervention. For all sites, codes for this item are limited to 0, 1 and 9.", 
        "category": "Surgery", 
        "description": "Identifies the removal, biopsy, or aspiration of regional lymph node(s) at the time of surgery of the primary site or during a separate surgical event.    ", 
        "field_name": "RX_SUMM_SCOPE_REG_LN_SUR", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments: 0 = No regional lymph node surgery      1 = Regional lymph node surgery      9 = Unknown if there was any regional lymph node surgery      ", 
        "registry_coding_instructions": "The scope of regional lymph node surgery is collected for each surgical event even if surgery of the primary site was not performed.      Record surgical procedures which aspirate, biopsy, or remove regional lymph nodes in an effort to diagnose or stage disease in this data item. Record the date of this surgical procedure in data item Date of First Course of Treatment (NAACCR Item #1270) and/or Date of First Surgical Procedure (NAACCR Item #1200) as appropriate.      For primaries of the meninges, brain, spinal cord, cranial nerves, and other parts of the central nervous system (C70.0-C70.9, C71.0-C71.9, C72.0-C72.9), code 9.      For lymphomas with a lymph node primary site (C77.0-C77.9), code 9.      For an unknown or ill-defined primary (C76.0-C76.8, C80.9) or for hematopoietic, reticuloendothelial, immunoproliferative, or myeloproliferative disease regardless of site, code 9.      Do not code distant lymph nodes removed during surgery to the primary site for this data item. Distant nodes are coded in the data field Surgical Procedure/Other Site (NAACCR Item #1294).      Refer to the applicable AJCC Cancer Staging Manual for site-specific identification of regional lymph nodes.      If the procedure coded in this item was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record this surgery in the item Palliative Care (NAACCR Item #3270).", 
        "table": {}, 
        "title": "Scope of Regional LN Surgery"
    }, 
    {
        "NAACCR Item #": "1292", 
        "allowable_values": "0, 1, 2, 3, 4, 5, 6, 7, 9", 
        "analytical note": null, 
        "category": "Surgery", 
        "description": null, 
        "field_name": "RX_SUMM_SCOPE_REG_LN_2012", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {}, 
        "title": "Scope of Regional LN Surgery 2012"
    }, 
    {
        "NAACCR Item #": "1294", 
        "allowable_values": " 0-5, 9", 
        "analytical note": "This item was reported as a site-specific item using the ROADS manual for diagnosis years 1998 - 2002.  It has been converted to FORDS form by NCDB.  For cases diagnosed on or after January 1, 2003, the surgery of other regional or distant sites, or distant lymph nodes was reported using the FORDS manual; it is no longer specific to the organ of origin.", 
        "category": "Surgery", 
        "description": "Records the surgical removal of distant lymph nodes or other tissue(s)/organ(s) beyond the primary site.  ", 
        "field_name": "RX_SUMM_SURG_OTH_REGDIS", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Assign the highest numbered code that describes the surgical resection of distant lymph node(s) and/or regional/distant tissue or organs.      Incidental removal of tissue or organs is not recorded as a Surgical Procedure/Other Site.      Code 1 if any surgery is performed to treat tumors of unknown or ill-defined primary sites (C76.0-C76.8, C80.9) or for hematopoietic, reticuloendothelial, immunoproliferative, or myeloproliferative disease (C42.0, C42.1, C42.3, C42.4 or any site with hematopoietic histologies).      If the procedure coded in this item was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record this surgery in the item Palliative Care (NAACCR Item #3270).", 
        "table": {
            "0": [
                "None", 
                "No nonprimary surgical site resection was performed. Diagnosed at autopsy."
            ], 
            "1": [
                "Nonprimary surgical procedure performed", 
                "Nonprimary surgical resection to other site(s), unknown if whether the site(s) is regional or distant."
            ], 
            "2": [
                "Nonprimary surgical procedure to other regional sites", 
                "Resection of regional site."
            ], 
            "3": [
                "Nonprimary surgical procedure to distant lymph node(s)", 
                "Resection of distant lymph node(s)."
            ], 
            "4": [
                "Nonprimary surgical procedure to distant site", 
                "Resection of distant site."
            ], 
            "5": [
                "Combination of codes", 
                "Any combination of surgical procedures 2, 3, or 4."
            ], 
            "9": [
                "Unknown", 
                "It is unknown whether any surgical procedure of a nonprimary site was performed. Death certificate only."
            ]
        }, 
        "title": "Surgery Other Site"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "  0 - 9999", 
        "analytical note": "Both the Date of Most Definitive Surgery of the Primary Site and the Date of Surgical Discharge were added to FORDS in 2003, so this item is not defined before that.", 
        "category": "Surgery", 
        "description": "The number of days between the date the most definitive surgical procedure was performed on the primary site (NAACCR Item #3170) and the date the patient was discharged following primary site surgery (NAACCR Item #3180).", 
        "field_name": "SURG_DISCHARGE_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "No first course surgery, surgery unknown, elapsed days cannot be computed, or not available for these diagnosis years"
            ]
        }, 
        "title": "Surgical Inpatient Stay, Days from Surgery"
    }, 
    {
        "NAACCR Item #": "3190", 
        "allowable_values": "0-3, 9", 
        "analytical note": "This item is only reported using the FORDS manual for diagnosis years 2003 and later.", 
        "category": "Surgery", 
        "description": "Records a readmission to the same hospital, for the same illness, within 30 days of discharge following hospitalization for surgical resection of the primary site.", 
        "field_name": "READM_HOSP_30_DAYS", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Consult patient record or information from the billing department to determine if a readmission to the same hospital occurred within 30 days of the date recorded in the item Date of Surgical Discharge (NAACCR Item #3180).      Only record a readmission related to the treatment of this cancer.      Review the treatment plan to determine whether the readmission was planned.      If there was an unplanned admission following surgical discharge, check for an ICD-9-CM \"E\" code and record it, space allowing, as an additional ICD-9-CM Comorbidities and Complications item (NAACCR #3110, 3120, 3130, 3140, 3150, 3160, 3161, 3162, 3163, 3164).", 
        "table": {
            "0": [
                "No surgical procedure of the primary site was performed, or the patient was not readmitted to the same hospital within 30 days of discharge."
            ], 
            "1": [
                "A patient was surgically treated and was readmitted to the same hospital within 30 days of being discharged. This readmission was unplanned."
            ], 
            "2": [
                "A patient was surgically treated and was then readmitted to the same hospital within 30 days of being discharged. This readmission was planned (chemotherapy port insertion, revision of colostomy, etc.)"
            ], 
            "3": [
                "A patient was surgically treated and, within 30 days of being discharged, the patient had both a planned and an unplanned readmission to the same hospital."
            ], 
            "9": [
                "It is unknown whether surgery of the primary site was recommended or performed. It is unknown whether the patient was readmitted to the same hospital within 30 days of discharge."
            ]
        }, 
        "title": "Readmission Within 30 Days of Surgical Discharge"
    }, 
    {
        "NAACCR Item #": "1340", 
        "allowable_values": "0-2, 5-9", 
        "analytical note": "This item is reported using the FORDS manual for diagnosis years 2003 and later", 
        "category": "Surgery", 
        "description": "Records the reason that no surgery was performed on the primary site.   ", 
        "field_name": "REASON_FOR_NO_SURGERY", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "If Surgical Procedure of Primary Site (NAACCR Item #1290) is coded 00, then record the reason based on documentation in the patient record.      Code 1 if the treatment plan offered multiple options and the patient selected treatment that did not include surgery of the primary site, or if the option of \"no treatment\" was accepted by the patient.      Code 1 if Surgical Procedure of Primary Site (NAACCR Item #1290) is coded 98.      Code 7 if the patient refused recommended surgical treatment, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Cases coded 8 should be followed and updated to a more definitive code as appropriate.      Code 9 if the treatment plan offered multiple choices, but it is unknown which treatment, if any was provided.", 
        "table": {
            "0": [
                "Surgery of the primary site was performed."
            ], 
            "1": [
                "Surgery of the primary site was not performed because it was not part of the planned first course treatment."
            ], 
            "2": [
                "Surgery of the primary site was not recommended/performed because it was contraindicated due to patient risk factors (comorbid conditions, advanced age, etc.)"
            ], 
            "5": [
                "Surgery of the primary site was not performed because the patient died prior to planned or recommended surgery."
            ], 
            "6": [
                "Surgery of the primary site was not performed; it was recommended by the patient's physician, but was not performed as part of the first course of therapy. No reason was noted in patient record."
            ], 
            "7": [
                "Surgery of the primary site was not performed; it was recommended by the patient's physician, but this treatment was refused by the patient, the patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "8": [
                "Surgery of the primary site was recommended, but it is unknown if it was performed. Further follow-up is recommended."
            ], 
            "9": [
                "It is unknown whether surgery of the primary site was recommended or performed. Diagnosed at autopsy or death certificate only."
            ]
        }, 
        "title": "Reason for No Surgery"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": null, 
        "category": "Radiation", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which radiation therapy was started (NAACCR Item #1210)", 
        "field_name": "DX_RAD_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "Radiation therapy not administered, radiation therapy unknown, or cannot compute days elapsed due to missing or incomplete dates"
            ]
        }, 
        "title": "Radiation, Days from Dx "
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0-5, 9", 
        "analytical note": "This item is reported using the ROADS and DAM manuals for cases diagnosed December 31, 2002, and earlier.  For cases diagnosed January 1, 2003 and later the code reported in this item as been imputed from the reported regional treatment modality using the FORDS manual.", 
        "category": "Radiation", 
        "description": "Records the type of radiation administered to the primary site or any metastatic site and includes all radiation therapy that is part of the first course of treatment, whether delivered at the reporting institution or at other institutions.  ", 
        "field_name": "RX_SUMM_RADIATION", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Record the type of radiation administered to the primary site or any metastatic site.      Include all procedures that are a part of the first course of treatment, whether delivered at the reporting institution or at other institutions.", 
        "table": {
            "0": [
                "None", 
                "Radiation not administered."
            ], 
            "1": [
                "Beam radiation", 
                "X-ray, cobalt, linear accelerator, neutron beam, betatron, spray radiation, intraoperative radiation and stereotactic radiosurgery (gamma knife and proton beam)."
            ], 
            "2": [
                "Radioactive implants", 
                "Brachytherapy, interstitial implants, molds, seeds, needles, or intracavitary applicators of radioactive materials (cesium, radium, radon, and radioactive gold)."
            ], 
            "3": [
                "Radioisotopes", 
                "Internal use of radioactive isotopes (iodine-131, phosphorus-32, strontium 89 and 90).  Can be administered orally, intracavitary, or by intravenous injection."
            ], 
            "4": [
                "Combination of beam radiation with radioactive implants or radioisotopes", 
                "Combination of code 1 with codes 2 and/or 3."
            ], 
            "5": [
                "Radiation therapy, NOS", 
                "Radiation was administered, but the method or source is not documented."
            ], 
            "9": [
                "Unknown", 
                "Unknown if radiation therapy recommended or administered; death certificate only."
            ]
        }, 
        "title": "Radiation Therapy"
    }, 
    {
        "NAACCR Item #": "1550", 
        "allowable_values": " 0-4, 8, 9", 
        "analytical note": "This item is reported as an optional item per the ROADS manual for cases diagnosed between January 1, 1996, and December 31, 2002, and required by FORDS thereafter.", 
        "category": "Radiation", 
        "description": "Identifies the location where radiation therapy was administered during the first course of treatment, as \"at the reporting facility\" or \"elsewhere\".  ", 
        "field_name": "RAD_LOCATION_OF_RX", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "If the radiation treatment was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record the radiation administered in the items Palliative Care (NAACCR Item #3270) and/or Palliative Care at This Facility (NAACCR Item #3280), as appropriate.", 
        "table": {
            "0": [
                "None", 
                "No radiation therapy was administered to the patient. Diagnosed at autopsy."
            ], 
            "1": [
                "All radiation treatment at this facility", 
                "All radiation therapy was administered at the reporting facility."
            ], 
            "2": [
                "Regional treatment at this facility, boost elsewhere", 
                "Regional treatment was administered at the reporting facility; a boost dose was administered elsewhere"
            ], 
            "3": [
                "Boost radiation at this facility, regional elsewhere", 
                "Regional treatment was administered elsewhere; a boost dose was administered at the reporting facility."
            ], 
            "4": [
                "All radiation treatment elsewhere", 
                "All radiation therapy was administered elsewhere."
            ], 
            "8": [
                "Other", 
                "Radiation therapy was administered, but the pattern does not fit the above categories."
            ], 
            "9": [
                "Unknown", 
                "Radiation therapy was administered, but the location of the treatment facility is unknown or not stated in patient record; it is unknown whether radiation therapy was administered. Death certificate only."
            ]
        }, 
        "title": "Location of Radiation Therapy"
    }, 
    {
        "NAACCR Item #": "1540", 
        "allowable_values": "00-41, 50, 60, 98, 99", 
        "analytical note": "This item is reported as an optional item per the ROADS manual for cases diagnosed between January 1, 1996, and December 31, 2002, and required thereafter.", 
        "category": "Radiation", 
        "description": "Identifies the volume or anatomic target of the most clinically significant regional radiation therapy delivered to the patient during the first course of treatment.", 
        "field_name": "RAD_TREAT_VOL", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Radiation treatment volume will typically be found in the radiation oncologist's summary letter for the first course of treatment. Determination of the exact treatment volume may require assistance from the radiation oncologist for consistent coding.      If two discrete volumes are treated and one of those includes the primary site, record the treatment to the primary site.", 
        "table": {
            "00": [
                "No radiation treatment", 
                "Radiation therapy was not administered to the patient. Diagnosed at autopsy."
            ], 
            "01": [
                "Eye/orbit", 
                "The radiation therapy target volume is limited to the eye and/or orbit."
            ], 
            "02": [
                "Pituitary", 
                "The target volume is restricted to the pituitary gland and all adjacent volumes are irradiated incidentally."
            ], 
            "03": [
                "Brain (NOS)", 
                "Treatment is directed at tumors lying within the substance of the brain, or its meninges."
            ], 
            "04": [
                "Brain (limited)", 
                "The treatment volume encompasses less than the total brain, or less than all of the meninges."
            ], 
            "05": [
                "Head and neck (NOS)", 
                "The treatment volume is directed at a primary tumor of the oropharyngeal complex, usually encompassing regional lymph nodes."
            ], 
            "06": [
                "Head and neck (limited)", 
                "Limited volume treatment of a head and neck primary with the exception of glottis (code 7), sinuses (code 8), or parotid (code 9)."
            ], 
            "07": [
                "Glottis", 
                "Treatment is limited to a volume in the immediate neighborhood of the vocal cords."
            ], 
            "08": [
                "Sinuses", 
                "The primary target is one or both of the maxillary sinuses or the ethmoidal frontal sinuses. In some cases, the adjacent lymph node regions my be irradiated."
            ], 
            "09": [
                "Parotid", 
                "The primary target is one of the parotid glands. There may be secondary regional lymph node irradiation as well."
            ], 
            "10": [
                "Chest/lung (NOS)", 
                "Radiation therapy is directed to some combination of hilar, mediastinal, and/or supraclavicular lymph nodes, and/or peripheral lung structures."
            ], 
            "11": [
                "Lung (limited)", 
                "Radiation therapy is directed at one region of the lung without nodal irradiation."
            ], 
            "12": [
                "Esophagus", 
                "The primary target is some portion of the esophagus. Regional lymph nodes may or may not be included in the treatment. Include tumors of the gastroesophageal junction."
            ], 
            "13": [
                "Stomach", 
                "The primary malignancy is in the stomach. Radiation is directed to the stomach and possibly adjacent lymph nodes."
            ], 
            "14": [
                "Liver", 
                "The primary target is all or a portion of the liver, for either primary or metastatic disease."
            ], 
            "15": [
                "Pancreas", 
                "The primary tumor is in the pancreas. The treatment field encompasses the pancreas and possibly adjacent lymph node regions."
            ], 
            "16": [
                "Kidney", 
                "The target is primary or metastatic disease in the kidney or the kidney bed after resection of a primary kidney tumor. Adjacent lymph node regions may be included in the field."
            ], 
            "17": [
                "Abdomen (NOS)", 
                "Include all treatment of abdominal contents that do not fit codes 12-16."
            ], 
            "18": [
                "Breast", 
                "The primary target is the intact breast and no attempt has been made to irradiate the regional lymph nodes. Intact breast includes breast tissue that either was not surgically treated or received a lumpectomy or partial mastectomy (C50.0-C50.9, Surgical Procedure of Primary Site [NAACCR Item #1290] codes 0-24)."
            ], 
            "19": [
                "Breast/lymph nodes", 
                "A deliberate attempt has been made to include regional lymph nodes in the treatment of an intact breast.  See definition of intact breast above."
            ], 
            "20": [
                "Chest wall", 
                "Treatment encompasses the chest wall (following mastectomy)."
            ], 
            "21": [
                "Chest wall/lymph nodes", 
                "Treatment encompasses the chest wall (following mastectomy) plus fields directed at regional lymph nodes."
            ], 
            "22": [
                "Mantle, Mini-mantle", 
                "Treatment consists of a large radiation field designed to encompass all of the regional lymph nodes above the diaphragm, including cervical, supraclavicular, axillary, mediastinal, and hilar nodes (mantle), or most of them (mini-mantle).This code is used exclusively for patients with Hodgkin's or non-Hodgkin's lymphoma."
            ], 
            "23": [
                "Lower extended field", 
                "The target zone includes lymph nodes below the diaphragm along the paraaortic chain. It may include extension to one side of the pelvis.  This code includes the \"hockey stick\" field utilized to treat seminomas."
            ], 
            "24": [
                "Spine", 
                "The primary target relates to the bones of the spine, including the sacrum.  Spinal cord malignancies should be coded 40 (Spinal cord)."
            ], 
            "25": [
                "Skull", 
                "Treatment is directed at the bones of the skull. Any brain irradiation is a secondary consequence."
            ], 
            "26": [
                "Ribs", 
                "Treatment is directed toward metastatic disease in one or more ribs. Fields may be tangential or direct."
            ], 
            "27": [
                "Hip", 
                "The target includes the proximal femur for metastatic disease. In may cases there may be acetabular disease as well."
            ], 
            "28": [
                "Pelvic bones", 
                "The target includes structures of the bones of the pelvis other than the hip or sacrum."
            ], 
            "29": [
                "Pelvis (NOS)", 
                "Irradiation is directed at soft tissues within the pelvic region and codes 34-36 do not apply."
            ], 
            "30": [
                "Skin", 
                "The primary malignancy originates in the skin and the skin is the primary target.  So-called skin metastases are usually subcutaneous and should be coded 31 (Soft tissue)."
            ], 
            "31": [
                "Soft tissue", 
                "All treatment of primary or metastatic soft tissue malignancies not fitting other categories."
            ], 
            "32": [
                "Hemibody", 
                "A single treatment volume encompassing either all structures above the diaphragm, or all structures below the diaphragm.  This is almost always administered for palliation of widespread bone metastasis in patients with prostate or breast cancer."
            ], 
            "33": [
                "Whole body", 
                "Entire body included in a single treatment."
            ], 
            "34": [
                "Bladder and pelvis", 
                "The primary malignancy originated in the bladder, all or most of the pelvis is treated as part of the plan, typically with a boost to the bladder."
            ], 
            "35": [
                "Prostate and pelvis", 
                "The primary malignancy originated in the prostate, all or most of the pelvis is treated as part of the plan, typically with a boost to the prostate."
            ], 
            "36": [
                "Uterus and cervix", 
                "Treatment is confined to the uterus and cervix or vaginal cuff, usually by intracavitary or interstitial technique.  If entire pelvis is included in a portion of the treatment, then code 29 (Pelvis, NOS)."
            ], 
            "37": [
                "Shoulder", 
                "Treatment is directed to the proximal humerus, scapula, clavicle, or other components of the shoulder complex.  This is usually administered for control of symptoms for metastases."
            ], 
            "38": [
                "Extremity bone, NOS", 
                "Bones of the arms or legs.  This excludes the proximal femur, code 27 (Hip).  This excludes the proximal humerus, code 37 (Shoulder)."
            ], 
            "39": [
                "Inverted Y", 
                "Treatment has been given to a field that encompasses the paraaortic and bilateral inguinal or inguinofemoral lymph nodes in a single port."
            ], 
            "40": [
                "Spinal cord", 
                "Treatment is directed at the spinal cord or its meninges."
            ], 
            "41": [
                "Prostate", 
                "Treatment is directed at the prostate with or without the seminal vesicles, without regional lymph node treatment."
            ], 
            "50": [
                "Thyroid", 
                "Treatment is directed at the thyroid gland."
            ], 
            "60": [
                "Lymph node region, NOS", 
                "The target is a group of lymph nodes not listed above. Examples include isolated treatment of a cervical, supraclavicular, or inguinofemoral region."
            ], 
            "98": [
                "Other", 
                "Radiation therapy administered, treatment volume other than those previously categorized."
            ], 
            "99": [
                "Unknown", 
                "Radiation therapy administered, treatment volume unknown or not stated in patient record; it is unknown whether radiation therapy was administered. Death certificate only."
            ]
        }, 
        "title": "Radiation Treatment Volume   "
    }, 
    {
        "NAACCR Item #": "1570", 
        "allowable_values": "00, 20-32, 50-55, 60-62, 98, 99", 
        "analytical note": "This item is reported as an optional item per the ROADS manual for cases diagnosed between January 1, 1996, and December 31, 2002, and required thereafter.  For cases diagnosed December 31, 2002 and earlier where this item was not reported, an imputed value from the ROADS radiation therapy item (NAACCR Item# 1350) has been used to assign this item.      Codes 80 and 85 retain specific converted descriptions of radiation therapy coded according to ROADS and DAM rules, and were not to be used to record regional radiation for cases diagnosed January 1, 2003, or later.", 
        "category": "Radiation", 
        "description": " Records the dominant modality of radiation therapy used to deliver the most clinically significant regional dose to the primary volume of interest during the first course of treatment.", 
        "field_name": "RAD_REGIONAL_RX_MODALITY", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Radiation treatment modality will typically be found in the radiation oncologist's summary letter for the first course of treatment. Segregation of treatment components into regional and boost and determination of the respective treatment modality may require assistance from the radiation oncologist to ensure consistent coding.      In the event multiple radiation therapy modalities were employed in the treatment of the patient, record only the dominant modality.      Note that in some circumstances the boost treatment may precede the regional treatment.      For purposes of this data item, photons and x-rays are equivalent.", 
        "table": {
            "00": [
                "No radiation treatment", 
                "Radiation therapy was not administered to the patient. Diagnosed at autopsy."
            ], 
            "20": [
                "External beam, NOS", 
                "The treatment is known to be by external beam, but there is insufficient information to determine the specific modality."
            ], 
            "21": [
                "Orthovoltage", 
                "External beam therapy administered using equipment with a maximum energy of less than one (1) million volts (MV). Orthovoltage energies are typically expressed in units of kilovolts (kV)."
            ], 
            "22": [
                "Cobalt-60, Cesium-137", 
                "External beam therapy using a machine containing either a Cobalt- 60 or Cesium-137 source. Intracavitary use of these sources is coded either 50 or 51."
            ], 
            "23": [
                "Photons (2-5 MV)", 
                "External beam therapy using a photon producing machine with beam energy in the range of 2-5 MV."
            ], 
            "24": [
                "Photons (6-10 MV)", 
                "External beam therapy using a photon producing machine with beam energy in the range of 6-10 MV."
            ], 
            "25": [
                "Photons (11-19 MV)", 
                "External beam therapy using a photon producing machine with beam energy in the range of 11-19 MV."
            ], 
            "26": [
                "Photons (>19 MV)", 
                "External beam therapy using a photon producing machine with beam energy of more than 19 MV."
            ], 
            "27": [
                "Photons (mixed energies)", 
                "External beam therapy using more than one energy over the course of treatment."
            ], 
            "28": [
                "Electrons", 
                "Treatment delivered by electron beam."
            ], 
            "29": [
                "Photons and electrons mixed", 
                "Treatment delivered using a combination of photon and electron beams."
            ], 
            "30": [
                "Neutrons, with or without photons/electrons", 
                "Treatment delivered using neutron beam."
            ], 
            "31": [
                "IMRT", 
                "Intensity modulated radiation therapy, an external beam technique that should be clearly stated in patient record."
            ], 
            "32": [
                "Conformal or 3-D therapy", 
                "An external beam technique using multiple, fixed portals shaped to conform to a defined target volume. Should be clearly described as conformal or 3-D therapy in patient record."
            ], 
            "40": [
                "Protons", 
                "Treatment delivered using proton therapy."
            ], 
            "41": [
                "Stereotactic radiosurgery, NOS", 
                "Treatment delivered using stereotactic radiosurgery, type not specified in patient record."
            ], 
            "42": [
                "Linac radiosurgery", 
                "Treatment categorized as using stereotactic technique delivered with a linear accelerator."
            ], 
            "43": [
                "Gamma Knife", 
                "Treatment categorized as using stereotactic technique delivered using a Gamma Knife machine."
            ], 
            "50": [
                "Brachytherapy, NOS", 
                "Brachytherapy, interstitial implants, molds, seeds, needles, or intracavitary applicators of radioactive materials not otherwise specified."
            ], 
            "51": [
                "Brachytherapy, Intracavitary, LDR", 
                "Intracavitary (no direct insertion into tissues) radio-isotope treatment using low dose rate applicators and isotopes (Cesium-137, Fletcher applicator)."
            ], 
            "52": [
                "Brachytherapy, Intracavitary, HDR", 
                "Intracavitary (no direct insertion into tissues) radioisotope treatment using high dose rate after-loading applicators and isotopes."
            ], 
            "53": [
                "Brachytherapy, Interstitial, LDR", 
                "Interstitial (direct insertion into tissues) radioisotope treatment using low dose rate sources."
            ], 
            "54": [
                "Brachytherapy, Interstitial, HDR", 
                "Interstitial (direct insertion into tissues) radioisotope treatment using high dose rate sources."
            ], 
            "55": [
                "Radium", 
                "Infrequently used for low dose rate (LDR) interstitial and intracavitary therapy."
            ], 
            "60": [
                "Radioisotopes, NOS", 
                "Iodine-131, Phosphorus-32, etc."
            ], 
            "61": [
                "Strontium-89", 
                "Treatment primarily by intravenous routes for bone metastases."
            ], 
            "62": [
                "Strontium-90", 
                ""
            ], 
            "80*": [
                "Combination modality, specified*", 
                "Combination of external beam radiation and either radioactive implants or radioisotopes*"
            ], 
            "85*": [
                "Combination modality, NOS*", 
                "Combination of radiation treatment modalities not specified in code 80.*"
            ], 
            "98": [
                "Other, NOS", 
                "Radiation therapy administered, but the treatment modality is not specified or is unknown."
            ], 
            "99": [
                "Unknown", 
                "Radiation therapy administered, treatment volume unknown or not stated in the patient record; it is unknown whether radiation therapy was administered. Death certificate only."
            ]
        }, 
        "title": "Regional Treatment Modality"
    }, 
    {
        "NAACCR Item #": "1510", 
        "allowable_values": "00000 - 88887, 88888, 99999", 
        "analytical note": "This item is reported as an optional item per the ROADS manual for cases diagnosed between January 1, 1996 and December 31, 2002, and required thereafter.", 
        "category": "Radiation", 
        "description": "Records the dominant or most clinically significant total dose of regional radiation therapy delivered to the patient during the first course of treatment. The unit of measure is centiGray (cGy).", 
        "field_name": "RAD_REGIONAL_DOSE_CGY", 
        "format": null, 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "The International Council for Radiation Protection (ICRP) recommends recording doses at the axis point where applicable (opposed fields, four field box, wedged pair, and so on). For maximum consistency in this data item, the ICRP recommendations should be followed whenever possible. Where there is no clear axis point, record the dose as indicated in the summary chart. Determining the exact dose may be highly subjective and require assistance from the radiation oncologist for consistent coding.      Regional dose will typically be found in the radiation oncologist's summary letter for the first course of treatment. Determination of the total dose of regional radiation therapy may require assistance from the radiation oncologist for consistent coding.      Do not include the boost dose, if one was administered.      Code 88888 when brachytherapy or radioisotopes--codes 50-62 for Regional Treatment Modality (NAACCR Item #1570)--were administered to the patient.       Note that dose is still occasionally specified in \"rads.\" One rad is equivalent to one centiGray (cGy).", 
        "table": {
            "(fill spaces)": [
                "Record the actual regional dose delivered."
            ], 
            "00000": [
                "Radiation therapy was not administered. Diagnosed at autopsy."
            ], 
            "88888": [
                "Not applicable, brachytherapy or radioisotopes administered to the patient."
            ], 
            "99999": [
                "Regional radiation therapy was administered, but the dose is unknown; it is unknown whether radiation therapy was administered. Death certificate only."
            ]
        }, 
        "title": "Regional Dose"
    }, 
    {
        "NAACCR Item #": "3200", 
        "allowable_values": " 00, 20-32, 50-55, 60-62, 98, 99", 
        "analytical note": "This item was only reported using FORDS diagnosed January 1, 2003, and later.", 
        "category": "Radiation", 
        "description": "Records the dominant modality of radiation therapy used to deliver the most clinically significant boost dose to the primary volume of interest during the first course of treatment. This is accomplished with external beam fields of reduced size (relative to the regional treatment fields), implants, stereotactic radiosurgery, conformal therapy, or IMRT. External beam boosts may consist of two or more successive phases with progressively smaller fields generally coded as a single entity.", 
        "field_name": "RAD_BOOST_RX_MODALITY", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Radiation boost treatment modalities will typically be found in the radiation oncologist's summary letter for the first course of treatment. Segregation of treatment components into regional and boost and determination of the respective treatment modality may require assistance from the radiation oncologist to ensure consistent coding.      In the event that multiple radiation therapy boost modalities were employed during the treatment of the patient, record only the dominant modality.      Note that in some circumstances, the boost treatment may precede the regional treatment.      For purposes of this field, photons and x-rays are equivalent.", 
        "table": {
            "00": [
                "No radiation treatment", 
                "Radiation therapy was not administered to the patient. Diagnosed at autopsy."
            ], 
            "20": [
                "External beam, NOS", 
                "The treatment is known to be by external beam, but there is insufficient information to determine the specific modality."
            ], 
            "21": [
                "Orthovoltage", 
                "External beam therapy administered using equipment with a maximum energy of less than one (1) million volts (MV). Orthovoltage energies are typically expressed in units of kilovolts (kV)."
            ], 
            "22": [
                "Cobalt-60, Cesium-137", 
                "External beam therapy using a machine containing either a Cobalt- 60 or Cesium-137 source. Intracavitary use of these sources is coded either 50 or 51."
            ], 
            "23": [
                "Photons (2-5 MV)", 
                "External beam therapy using a photon producing machine with beam energy in the range of 2-5 MV."
            ], 
            "24": [
                "Photons (6-10 MV)", 
                "External beam therapy using a photon producing machine with beam energy in the range of 6-10 MV."
            ], 
            "25": [
                "Photons (11-19 MV)", 
                "External beam therapy using a photon producing machine with beam energy in the range of 11-19 MV."
            ], 
            "26": [
                "Photons (>19 MV)", 
                "External beam therapy using a photon producing machine with beam energy of more than 19 MV."
            ], 
            "27": [
                "Photons (mixed energies)", 
                "External beam therapy using more than one energy over the course of treatment."
            ], 
            "28": [
                "Electrons", 
                "Treatment delivered by electron beam."
            ], 
            "29": [
                "Photons and electrons mixed", 
                "Treatment delivered using a combination of photon and electron beams."
            ], 
            "30": [
                "Neutrons, with or without photons/electrons", 
                "Treatment delivered using neutron beam."
            ], 
            "31": [
                "IMRT", 
                "Intensity modulated radiation therapy, an external beam technique that should be clearly stated in patient record."
            ], 
            "32": [
                "Conformal or 3-D therapy", 
                "An external beam technique using multiple, fixed portals shaped to conform to a defined target volume. Should be clearly described as conformal or 3-D therapy in patient record."
            ], 
            "40": [
                "Protons", 
                "Treatment delivered using proton therapy."
            ], 
            "41": [
                "Stereotactic radiosurgery, NOS", 
                "Treatment delivered using stereotactic radiosurgery, type not specified in patient record."
            ], 
            "42": [
                "Linac radiosurgery", 
                "Treatment categorized as using stereotactic technique delivered with a linear accelerator."
            ], 
            "43": [
                "Gamma Knife", 
                "Treatment categorized as using stereotactic technique delivered using a Gamma Knife machine."
            ], 
            "50": [
                "Brachytherapy, NOS", 
                "Brachytherapy, interstitial implants, molds, seeds, needles, or intracavitary applicators of radioactive materials not otherwise specified."
            ], 
            "51": [
                "Brachytherapy, Intracavitary, LDR", 
                "Intracavitary (no direct insertion into tissues) radio-isotope treatment using low dose rate applicators and isotopes (Cesium-137, Fletcher applicator)."
            ], 
            "52": [
                "Brachytherapy, Intracavitary, HDR", 
                "Intracavitary (no direct insertion into tissues) radioisotope treatment using high dose rate after-loading applicators and isotopes."
            ], 
            "53": [
                "Brachytherapy, Interstitial, LDR", 
                "Interstitial (direct insertion into tissues) radioisotope treatment using low dose rate sources."
            ], 
            "54": [
                "Brachytherapy, Interstitial, HDR", 
                "Interstitial (direct insertion into tissues) radioisotope treatment using high dose rate sources."
            ], 
            "55": [
                "Radium", 
                "Infrequently used for low dose rate (LDR) interstitial and intracavitary therapy."
            ], 
            "60": [
                "Radioisotopes, NOS", 
                "Iodine-131, Phosphorus-32, etc."
            ], 
            "61": [
                "Strontium-89", 
                "Treatment primarily by intravenous routes for bone metastases."
            ], 
            "62": [
                "Strontium-90", 
                ""
            ], 
            "80": [
                "Combination modality, specified", 
                "Combination of external beam radiation and either radioactive implants or radioisotopes"
            ], 
            "85": [
                "Combination modality, NOS", 
                "Combination of radiation treatment modalities not specified in code 80."
            ], 
            "98": [
                "Other, NOS", 
                "Radiation therapy administered, but the treatment modality is not specified or is unknown."
            ], 
            "99": [
                "Unknown", 
                "Radiation therapy administered, treatment volume unknown or not stated in the patient record; it is unknown whether radiation therapy was administered. Death certificate only."
            ]
        }, 
        "title": "Boost Treatment Modality"
    }, 
    {
        "NAACCR Item #": "3210", 
        "allowable_values": "00000 - 88887, 88888, 99999", 
        "analytical note": "This item was only reported using FORDS diagnosed January 1, 2003, and later.", 
        "category": "Radiation", 
        "description": "Records the additional dose delivered to that part of the treatment volume encompassed by the boost fields or devices. The unit of measure is centiGray (cGy).", 
        "field_name": "RAD_BOOST_DOSE_CGY", 
        "format": null, 
        "length": "5", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "The International Council for Radiation Protection (ICRP) recommends recording doses at the axis point where applicable (opposed fields, four field box, wedged pair, and so on). For maximum consistency in this data item, the ICRP recommendations should be followed whenever possible. Where there is no clear axis point, record the dose as indicated in the summary chart. Consult the radiation oncologist for the exact dose, if necessary.      Radiation boost treatment dose will typically be found in the radiation oncologist's summary letter for the first course of treatment. Determination of the additional boost dose of radiation therapy may require assistance from the radiation oncologist for consistent coding.      Do not include the regional dose. In general, the boost dose will be calculated as the difference between the maximum prescribed dose and the regional dose. Many patients will not have a boost.      Code 88888 when brachytherapy or radioisotopes--codes 50-62 for Boost Treatment Modality (NAACCR Item #3200)--were administered to the patient.      Note that dose is still occasionally specified in \"rads.\" One rad is equivalent to one centiGray (cGy).      There may be times when the first course of treatment information is incomplete. Therefore, it is important to continue follow-up efforts to be certain the complete treatment information is collected.", 
        "table": {
            "(fill spaces)": [
                "Record the actual regional dose delivered."
            ], 
            "00000": [
                "Radiation therapy was not administered. Diagnosed at autopsy."
            ], 
            "88888": [
                "Not applicable, brachytherapy or radioisotopes administered to the patient."
            ], 
            "99999": [
                "Regional radiation therapy was administered, but the dose is unknown; it is unknown whether radiation therapy was administered. Death certificate only."
            ]
        }, 
        "title": "Boost Dose"
    }, 
    {
        "NAACCR Item #": "1520", 
        "allowable_values": "000 - 999", 
        "analytical note": "This item is reported as an optional item per the ROADS manual for cases diagnosed between January 1, 1996 and December 31, 2002, and required thereafter.", 
        "category": "Radiation", 
        "description": "Records the total number of treatment sessions (fractions) administered during the first course of treatment.   ", 
        "field_name": "RAD_NUM_TREAT_VOL", 
        "format": null, 
        "length": "3", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "The number of treatments or fractions will typically be found in the radiation oncologist's summary letter for the first course of treatment. Determination of the exact number of treatments or fractions delivered to the patient may require assistance from the radiation oncologist for consistent coding.      Although a treatment session may include several treatment portals delivered within a relatively confined period of time--usually a few minutes--it is still considered one session.      The total number of treatment sessions (fractions) is the sum of the number of fractions of regional treatment and the number of fractions of boost treatment.      Count brachytherapy or implants as a single treatment or fraction.", 
        "table": {
            "000": [
                "None", 
                "Radiation therapy was not administered to the patient. Diagnosed at autopsy."
            ], 
            "001-998": [
                "Number of treatments", 
                "Total number of treatment sessions administered to the patient."
            ], 
            "999": [
                "Unknown", 
                "Radiation therapy was administered, but the number of treatments is unknown. Or, it is unknown whether radiation therapy was administered. Death certificate only."
            ]
        }, 
        "title": "Number of Treatments to this Volume"
    }, 
    {
        "NAACCR Item #": "1380", 
        "allowable_values": "0, 2-6, 9", 
        "analytical note": "This item is reported as an optional item per the ROADS manual for cases diagnosed between January 1, 1996, and December 31, 2002, and required thereafter.  For cases diagnosed December 31, 2002 and earlier where this item was not reported, a value was imputed from the following ROADS items: Radiation Therapy (NAACCR Item# 1350); Date Radiation Started (NAACCR Item# 1210); Surgical Procedure of Primary Site (NAACCR Item #1290); Scope of Regional Lymph Node Surgery (NAACCR Item #1292); Surgical Procedure/Other Site (NAACCR Item #1294); and Date of Definitive Surgery (NAACCR Item #3170) have been used to assign this item.      Beginning with 2010 diagnoses, when it is unknown whether radiation and/or surgery was performed, the code assigned changed from 9 to 0.  It is likely a shift in distribution of these two codes may be noticeable around that time.", 
        "category": "Radiation", 
        "description": " Records the sequencing of radiation and surgical procedures given as part of the first course of treatment.   ", 
        "field_name": "RX_SUMM_SURGRAD_SEQ", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Surgical procedures include Surgical Procedure of Primary Site (NAACCR Item #1290); Scope of Regional Lymph Node Surgery (NAACCR Item #1292); Surgical Procedure/Other Site (NAACCR Item #1294). If none of these procedures was performed and/or if no radiation therapy was administered then this item is coded 0.      If the patient received both radiation therapy and any one or a combination of the following surgical procedures: Surgical Procedure of Primary Site, Regional Lymph Node Surgery, or Surgical Procedure/Other Site, then code this item 2-9, as appropriate.", 
        "table": {
            "0": [
                "No radiation therapy and/or surgical procedures", 
                "No radiation therapy given; and/or no surgery of the primary site; no scope of regional lymph node surgery; no surgery to other regional site(s), distant site(s), or distant lymph node(s); or no reconstructive surgery.  It is unknown if radiation therapy was administered and/or it is unknown if surgery to primary site; scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s) was performed.  Diagnosed at autopsy."
            ], 
            "2": [
                "Radiation therapy before surgery", 
                "Radiation therapy given before surgery to primary site; scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s)."
            ], 
            "3": [
                "Radiation therapy after surgery", 
                "Radiation therapy given after surgery to primary site; scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s)."
            ], 
            "4": [
                "Radiation therapy both before and after surgery", 
                "Radiation therapy given before and after any surgery to primary site; scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s)."
            ], 
            "5": [
                "Intraoperative radiation therapy", 
                "Intraoperative therapy given during surgery to primary site; scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s)."
            ], 
            "6": [
                "Intraoperative radiation therapy with other therapy administered before or after surgery", 
                "Intraoperative radiation therapy given during surgery to primary site; scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s) with other radiation therapy administered before or after surgery to primary site; scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s)."
            ], 
            "9": [
                "Sequence unknown", 
                "Administration of radiation therapy and surgery to primary site, scope of regional lymph node surgery, surgery to other regional site(s), distant site(s), or distant lymph node(s) were performed and the sequence of the treatment is not stated in the patient record. Death certificate only."
            ]
        }, 
        "title": "Radiation Surgery Sequence"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 999", 
        "analytical note": null, 
        "category": "Radiation", 
        "description": "For diagnosis years prior to 2003, this item uses a single ROADS item containing the number of elapsed days between the start and end of radiation. For diagnosis years 2003 and later, this item is calculated as the number of days between the date radiation started (NAACCR Item #1210) and the date on which radiation therapy ended (NAACCR Item #3220). 1 is added to the number of days elapsed. This means that if radiation starts and ends on the same date, then 1 day has elapsed, if radiation ends the day after it is started, then 2 days have elapsed, and so on.  ", 
        "field_name": "RAD_ELAPSED_RX_DAYS", 
        "format": null, 
        "length": "3", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0": [
                "None, radiation not administered"
            ], 
            "1-998": [
                "Number of elapsed days"
            ], 
            "999": [
                "Missing or incomplete dates for radiation start and end, days elapsed missing, or unknown if had radiation"
            ]
        }, 
        "title": "Radiation Ended, Days from Start of Radiation"
    }, 
    {
        "NAACCR Item #": "1430", 
        "allowable_values": "0 - 2, 5 - 9", 
        "analytical note": "Prior to the implementation of FORDS in 2003, the information recorded in this item was limited to the content recorded as 0, 1, 7, 8 and 9.", 
        "category": "Radiation", 
        "description": "Records the reason that no regional radiation therapy was administered to the patient.   ", 
        "field_name": "REASON_FOR_NO_RADIATION", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "If Regional Treatment Modality (NAACCR Item #1570) is coded 00, then record the reason based on documentation in patient record.       Code 1 if the treatment plan offered multiple options and the patient selected treatment that did not include radiation therapy.      Code 7 if the patient refused recommended radiation therapy, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Cases coded 8 should be followed and updated to a more definitive code as appropriate.       Code 9 if the treatment plan offered multiple options, but it is unknown which treatment, if any, was provided.", 
        "table": {
            "0": [
                "Radiation therapy was administered."
            ], 
            "1": [
                "Radiation therapy was not administered because it was not part of the planned first course treatment."
            ], 
            "2": [
                "Radiation therapy was not recommended/administered because it was contraindicated due to other patient risk factors (comorbid conditions, advanced age, etc.)."
            ], 
            "5": [
                "Radiation therapy was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "6": [
                "Radiation therapy was not administered; it was recommended by the patient's physician, but was not administered as part of first course treatment. No reason was noted in patient record."
            ], 
            "7": [
                "Radiation therapy was not administered; it was recommended by the patient's physician, but this treatment was refused by the patient, the patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "8": [
                "Radiation therapy was recommended, but it is unknown whether it was administered."
            ], 
            "9": [
                "It is unknown if radiation therapy was recommended or administered. Death certificate and autopsy cases only."
            ]
        }, 
        "title": "Reason For No Radiation   "
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources.  Systemic treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.  This refers to the first administration of systemic treatment for the cancer by any facility. This item is only available for diagnosis years 2003 and later.", 
        "category": "Systemic", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which any systemic therapy [chemotherapy, hormone therapy, immunotherapy, or hematologic transplant and endocrine procedures] was started (NAACCR Item #3230).   ", 
        "field_name": "DX_SYSTEMIC_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "Systemic therapy not administered, therapy unknown, cannot compute days elapsed, or not available for these diagnosis years"
            ]
        }, 
        "title": "Systemic, Days from Dx"
    }, 
    {
        "NAACCR Item #": "1390", 
        "allowable_values": " 00 - 03, 82, 85 - 88, 99", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources.  Chemotherapy treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.  This refers to chemotherapy to treat the cancer by any facility.", 
        "category": "Systemic", 
        "description": "Records the type of chemotherapy administered as first course treatment at any facility. If chemotherapy was not administered, then this item records the reason it was not administered to the patient. Chemotherapy consists of a group of anticancer drugs that inhibit the reproduction of cancer cells by interfering with DNA synthesis and mitosis.   ", 
        "field_name": "RX_SUMM_CHEMO", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Code 00 if chemotherapy was not administered to the patient, and it is known that it is not usually administered for this type and stage of cancer.      Code 00 if the treatment plan offered multiple options, and the patient selected treatment that did not include chemotherapy.      If it is known that chemotherapy is usually administered for this type and stage of cancer, but was not administered to the patient, use code 82, 85, 86, or 87 to record the reason why it was not administered.      Code 87 if the patient refused recommended chemotherapy, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Code 99 if it is not known whether chemotherapy is usually administered for this type and stage of cancer and there is no mention in the patient record whether it was recommended or administered.      If the managing physician changes one of the agents in a combination regimen, and the replacement agent belongs to a different group (chemotherapeutic agents are grouped as alkylating agents, antimetabolites, natural products, or other miscellaneous) than the original agent, the new regimen represents the start of subsequent therapy, and only the original agent or regimen is recorded as first course therapy.      Refer to SEER*Rx (http://seer.cancer.gov/tools/seerrx/) for coding of chemotherapeutic, hormonal and immunotherapies.      If chemotherapy was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record the chemotherapy administered in the item Palliative Care (NAACCR Item #3270).      Update for 2013 PUF: Six drugs previously classified as Chemotherapy are now classified as BRM/Immunotherapy. This change in classification is effective only for cases diagnosed in January 1st, 2013 and forward. While the NCDB does not provide drug-specific data, changes in case counts may be observed for the Chemotherapy and Immunotherapy variables for cases diagnosed in 2013 due to the change in classification. The drugs are: Alemtuzumab/Campath, Bvacizumab/Avastin, Rituximab, Trastuzumab/Herceptin, Pertuzumab/Perjeta, and Cetuxumab/Erbitux.", 
        "table": {
            "00": [
                "None, chemotherapy was not part of the planned first course of therapy.  Diagnosed at autopsy."
            ], 
            "01": [
                "Chemotherapy administered as first course therapy, but the type and number of agents is not documented in patient record."
            ], 
            "02": [
                "Single-agent chemotherapy administered as first course therapy."
            ], 
            "03": [
                "Multiagent chemotherapy administered as first course therapy."
            ], 
            "82": [
                "Chemotherapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age)."
            ], 
            "85": [
                "Chemotherapy was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "86": [
                "Chemotherapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record."
            ], 
            "87": [
                "Chemotherapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "88": [
                "Chemotherapy was recommended, but it is unknown if it was administered."
            ], 
            "99": [
                "It is unknown whether a chemotherapeutic agent(s) was recommended or administered because it is not stated in patient record. Death certificate only."
            ]
        }, 
        "title": "Chemotherapy"
    }, 
    {
        "NAACCR Item #": "700", 
        "allowable_values": "00-03, 82, 58-88, 99", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources. This item identifies chemotherapy given at the reporting facility. The item Chemotherapy identifies chemotherapy given by any facility.", 
        "category": "Systemic", 
        "description": "Records the type of chemotherapy administered as first course treatment by the facility that submitted this record.  If chemotherapy was not administered, then this item records the reason it was not administered to the patient.", 
        "field_name": "RX_HOSP_CHEMO", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments:             <!--/*--><![CDATA[/* ><!--*/      table, th, td {border: 1px solid black; border-collapse: collapse;} th, td { padding: 5px;} th { text-align: left;}       /*--><!]]>*/             Code      Definition      00      None, chemotherapy was not part of the planned first course of therapy.  Diagnosed at autopsy.      01      Chemotherapy administered as first course therapy, but the type and number of agents is not documented in patient record.      02      Single-agent chemotherapy administered as first course therapy.      03      Multiagent chemotherapy administered as first course therapy.      82      Chemotherapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age).      85      Chemotherapy was not administered because the patient died prior to planned or recommended therapy.      86      Chemotherapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record.      87      Chemotherapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record.      88      Chemotherapy was recommended, but it is unknown if it was administered.      99      It is unknown whether a chemotherapeutic agent(s) was recommended or administered because it is not stated in patient record. Death certificate only.            ", 
        "registry_coding_instructions": "Code 00 if chemotherapy was not administered to the patient, and it is known that it is not usually administered for this type and stage of cancer.      Code 00 if the treatment plan offered multiple options, and the patient selected treatment that did not include chemotherapy.      If it is known that chemotherapy is usually administered for this type and stage of cancer, but was not administered to the patient, use code 82, 85, 86, or 87 to record the reason why it was not administered.      Code 87 if the patient refused recommended chemotherapy, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Code 99 if it is not known whether chemotherapy is usually administered for this type and stage of cancer and there is no mention in the patient record whether it was recommended or administered.      If the managing physician changes one of the agents in a combination regimen, and the replacement agent belongs to a different group (chemotherapeutic agents are grouped as alkylating agents, antimetabolites, natural products, or other miscellaneous) than the original agent, the new regimen represents the start of subsequent therapy, and only the original agent or regimen is recorded as first course therapy.      Refer to SEER*Rx (http://seer.cancer.gov/tools/seerrx/) for coding of chemotherapeutic, hormonal and immunotherapies.      Update effective starting with 2013 PUF: Six drugs previously classified as Chemotherapy are now classified as BRM/Immunotherapy. This change in classification is effective only for cases diagnosed in January 1st, 2013 and forward. While the NCDB does not provide drug-specific data, changes in case counts may be observed for the Chemotherapy and Immunotherapy variables for cases diagnosed in 2013 due to the change in classification. The drugs are: Alemtuzumab/Campath, Bvacizumab/Avastin, Rituximab, Trastuzumab/Herceptin, Pertuzumab/Perjeta, and Cetuxumab/Erbitux.", 
        "table": {
            "00": [
                "None, chemotherapy was not part of the planned first course of therapy.  Diagnosed at autopsy."
            ], 
            "01": [
                "Chemotherapy administered as first course therapy, but the type and number of agents is not documented in patient record."
            ], 
            "02": [
                "Single-agent chemotherapy administered as first course therapy."
            ], 
            "03": [
                "Multiagent chemotherapy administered as first course therapy."
            ], 
            "82": [
                "Chemotherapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age)."
            ], 
            "85": [
                "Chemotherapy was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "86": [
                "Chemotherapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record."
            ], 
            "87": [
                "Chemotherapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "88": [
                "Chemotherapy was recommended, but it is unknown if it was administered."
            ], 
            "99": [
                "It is unknown whether a chemotherapeutic agent(s) was recommended or administered because it is not stated in patient record. Death certificate only."
            ]
        }, 
        "title": "Chemotherapy at This Facility"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": "The portion of cases with unknown values for this item is higher for 2002 cases.  NCDB dropped the requirement to report systemic treatment-specific treatment dates in FORDS in 2003, and one or more registry software vendors dropped these dates from their data collection screens starting in January 2003 while a substantial proportion of 2002 cases were still being abstracted. NCDB subsequently requested vendors to submit these items if their registries were abstracting them.  However, for the cases that had already been entered, this information was not abstracted and was not submitted to NCDB.      CoC cancer programs are required to identify treatment their patients received from all sources.  Chemotherapy treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.  This refers to the first administration of chemotherapy for the cancer by any facility.", 
        "category": "Systemic", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which chemotherapy at any facility was started (NAACCR Item #1220).", 
        "field_name": "DX_CHEMO_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "Chemotherapy not administered, chemotherapy unknown, or days elapsed cannot be computed due to missing or incomplete dates"
            ]
        }, 
        "title": "Chemotherapy, Days from Dx"
    }, 
    {
        "NAACCR Item #": "1400", 
        "allowable_values": "00, 01, 82, 85 - 88, 99", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources. Hormone treatment may have been given by any facility, or at multiple facilities, not limited to the one whose report is included in this file.", 
        "category": "Systemic", 
        "description": "Records the type of hormone therapy administered as first course treatment at any facility. If hormone therapy was not administered, then this item records the reason it was not administered to the patient. Hormone therapy consists of a group of drugs that may affect the long-term control of a cancer's growth.      ", 
        "field_name": "RX_SUMM_HORMONE", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Record prednisone as hormonal therapy when administered in combination with chemotherapy, such as MOPP (mechlorethamine, vincristine, procarbazine, prednisone) or COPP (cyclophosphamide, vincristine, procarbazine, prednisone).      Do not code prednisone as hormone therapy when it is administered for reasons other than chemotherapeutic treatment.      Tumor involvement or treatment may destroy hormone-producing tissue. Hormone replacement therapy will be given if the hormone is necessary to maintain normal metabolism and body function. Do not code hormone replacement therapy as part of first course therapy.      Code 00 if hormone therapy was not administered to the patient, and it is known that it is not usually administered for this type and stage of cancer.      Code 00 if the treatment plan offered multiple options, and the patient selected treatment that did not include hormone therapy.      Code 01 for thyroid replacement therapy which inhibits TSH (thyroid-stimulating hormone). TSH is a product of the pituitary gland that can stimulate tumor growth.      If it is known that hormone therapy is usually administered for this type and stage of cancer, but was not administered to the patient, use code 82, 85, 86, or 87 to record the reason why it was not administered.      Code 87 if the patient refused recommended hormone therapy, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Code 99 if it is not known whether hormone therapy is usually administered for this type and stage of cancer, and there is no mention in the patient record whether it was recommended or administered.      Refer to SEER*Rx (http://seer.cancer.gov/tools/seerrx/) for instructions for coding hormonal, chemotherapeutic and immunotherapy agents.      If hormone therapy was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record the hormone therapy administered in the item Palliative Care (NAACCR Item #3270).", 
        "table": {
            "00": [
                "None, hormone therapy was not part of the planned first course of therapy.  Diagnosed at autopsy."
            ], 
            "01": [
                "Hormone therapy administered as first course therapy."
            ], 
            "82": [
                "Hormone therapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age)."
            ], 
            "85": [
                "Hormone therapy was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "86": [
                "Hormone therapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record."
            ], 
            "87": [
                "Hormone therapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "88": [
                "Hormone therapy was recommended, but it is unknown if it was administered."
            ], 
            "99": [
                "It is unknown whether a hormonal agent(s) was recommended or administered because it is not stated in patient record. Death certificate only."
            ]
        }, 
        "title": "Hormone Therapy"
    }, 
    {
        "NAACCR Item #": "710", 
        "allowable_values": "00, 01, 82, 85-88, 99", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources. This item identifies hormone therapy given at this facility. The item Hormone Therapy records first course hormone therapy from any facility.", 
        "category": "Systemic", 
        "description": "This item records the type of hormone therapy administered as first course treatment by the facility that submitted this record.  If hormone therapy was not administered, then this item records the reason it was not administered to the patient.  Hormone therapy consists of a group of drugs that may affect the long-term control of a cancer's growth.  ", 
        "field_name": "RX_HOSP_HORMONE", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": "NCDB System Code Assignments:             <!--/*--><![CDATA[/* ><!--*/      table, th, td {border: 1px solid black; border-collapse: collapse;} th, td { padding: 5px;} th { text-align: left;}       /*--><!]]>*/             Code      Definition      00      None, hormone therapy was not part of the planned first course of therapy.  Diagnosed at autopsy.      01      Hormone therapy administered as first course therapy.      82      Hormone therapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age).      85      Hormone therapy was not administered because the patient died prior to planned or recommended therapy.      86      Hormone therapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record.      87      Hormone therapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record.      88      Hormone therapy was recommended, but it is unknown if it was administered.      99      It is unknown whether a hormonal agent(s) was recommended or administered because it is not stated in patient record. Death certificate only.            ", 
        "registry_coding_instructions": "Record prednisone as hormonal therapy when administered in combination with chemotherapy, such as MOPP (mechlorethamine, vincristine, procarbazine, prednisone) or COPP (cyclophosphamide, vincristine, procarbazine, prednisone).      Do not code prednisone as hormone therapy when it is administered for reasons other than chemotherapeutic treatment.      Tumor involvement or treatment may destroy hormone-producing tissue. Hormone replacement therapy will be given if the hormone is necessary to maintain normal metabolism and body function. Do not code hormone replacement therapy as part of first course therapy.      Code 00 if hormone therapy was not administered to the patient, and it is known that it is not usually administered for this type and stage of cancer.      Code 00 if the treatment plan offered multiple options, and the patient selected treatment that did not include hormone therapy.      Code 01 for thyroid replacement therapy which inhibits TSH (thyroid-stimulating hormone). TSH is a product of the pituitary gland that can stimulate tumor growth.      If it is known that hormone therapy is usually administered for this type and stage of cancer, but was not administered to the patient, use code 82, 85, 86, or 87 to record the reason why it was not administered.      Code 87 if the patient refused recommended hormone therapy, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Code 99 if it is not known whether hormone therapy is usually administered for this type and stage of cancer, and there is no mention in the patient record whether it was recommended or administered.      Refer to SEER*Rx (http://seer.cancer.gov/tools/seerrx/) for instructions for coding hormonal, chemotherapeutic and immunotherapy agents.", 
        "table": {
            "00": [
                "None, hormone therapy was not part of the planned first course of therapy.  Diagnosed at autopsy."
            ], 
            "01": [
                "Hormone therapy administered as first course therapy."
            ], 
            "82": [
                "Hormone therapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age)."
            ], 
            "85": [
                "Hormone therapy was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "86": [
                "Hormone therapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record."
            ], 
            "87": [
                "Hormone therapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "88": [
                "Hormone therapy was recommended, but it is unknown if it was administered."
            ], 
            "99": [
                "It is unknown whether a hormonal agent(s) was recommended or administered because it is not stated in patient record. Death certificate only."
            ]
        }, 
        "title": "Hormone Therapy at This Facility"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources.  Hormone treatment may have been provided by any facility, or multiple facilities, not limited to the one whose report is included in this file.  This refers to the first administration of hormone treatment for the cancer by any facility.", 
        "category": "Systemic", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which hormone therapy at any facility was started (NAACCR Item #1230).", 
        "field_name": "DX_HORMONE_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "Hormone therapy not administered, hormone therapy unknown, or cannot compute elapsed days due to missing or incomplete dates"
            ]
        }, 
        "title": "Hormone Therapy, Days from Dx"
    }, 
    {
        "NAACCR Item #": "1410", 
        "allowable_values": "00, 01, 82, 85 - 88, 99", 
        "analytical note": "Agents included for immunotherapy are also known at biologic response modifiers.      CoC cancer programs are required to identify treatment their patients received from all sources.  Immunotherapy may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.", 
        "category": "Systemic", 
        "description": "Records the type of immunotherapy administered as first course treatment at this and all other facilities. If immunotherapy was not administered, then this item records the reason it was not administered to the patient. Immunotherapy consists of biological or chemical agents that alter the immune system or change the host's response to tumor cells.   ", 
        "field_name": "RX_SUMM_IMMUNOTHERAPY", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Code 00 if immunotherapy was not administered to the patient, and it is known that it is not usually administered for this type and stage of cancer.      Code 00 if the treatment plan offered multiple options, and the patient selected treatment that did not include immunotherapy.      If it is known that immunotherapy is usually administered for this type and stage of cancer, but was not administered to the patient, use code 82, 85, 86, or 87 to record the reason why it was not administered.      Code 87 if the patient refused recommended immunotherapy, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Code 99 if it is not known whether immunotherapy is usually administered for this type and stage of cancer, and there is no mention in the patient record whether it was recommended or administered.      Refer to SEER*Rx (http://seer.cancer.gov/tools/seerrx/) for instructions for coding immunotherapy, chemotherapeutic and hormonal agents.      If immunotherapy was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record the immunotherapy administered in the item Palliative Care (NAACCR Item #3270).      Update for 2013 PUF: Six drugs previously classified as Chemotherapy are now classified as BRM/Immunotherapy. This change in classification is effective only for cases diagnosed in January 1st, 2013 and forward. While the NCDB does not provide drug-specific data, changes in case counts may be observed for the Chemotherapy and Immunotherapy variables for cases diagnosed in 2013 due to the change in classification. The drugs are: Alemtuzumab/Campath, Bvacizumab/Avastin, Rituximab, Trastuzumab/Herceptin, Pertuzumab/Perjeta, and Cetuxumab/Erbitux.", 
        "table": {
            "00": [
                "None, immunotherapy was not part of the planned first course of therapy.  Diagnosed at autopsy."
            ], 
            "01": [
                "Immunotherapy administered as first course therapy."
            ], 
            "82": [
                "Immunotherapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age)."
            ], 
            "85": [
                " Immunotherapy was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "86": [
                "Immunotherapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record."
            ], 
            "87": [
                "Immunotherapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "88": [
                "Immunotherapy was recommended, but it is unknown if it was administered."
            ], 
            "99": [
                "It is unknown whether a immunotherapeutic agent(s) was recommended or administered because it is not stated in patient record. Death certificate only."
            ]
        }, 
        "title": "Immunotherapy"
    }, 
    {
        "NAACCR Item #": "720", 
        "allowable_values": "00, 01, 82, 85-88, 99", 
        "analytical note": "Immunotherapy is sometimes called biologic response modifier (BRM).      CoC cancer programs are required to identify treatment their patients received from all sources.  Immunotherapy may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.", 
        "category": "Systemic", 
        "description": "Records the type of immunotherapy administered as first course treatment at the facility that submitted the record.  If immunotherapy was not administered, then this item records the reason it was not administered to the patient.  ", 
        "field_name": "RX_HOSP_IMMUNOTHERAPY", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Code 00 if immunotherapy was not administered to the patient, and it is known that it is not usually administered for this type and stage of cancer.      Code 00 if the treatment plan offered multiple options, and the patient selected treatment that did not include immunotherapy.      If it is known that immunotherapy is usually administered for this type and stage of cancer, but was not administered to the patient, use code 82, 85, 86, or 87 to record the reason why it was not administered.      Code 87 if the patient refused recommended immunotherapy, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Code 99 if it is not known whether immunotherapy is usually administered for this type and stage of cancer, and there is no mention in the patient record whether it was recommended or administered.      Refer to SEER*Rx (http://seer.cancer.gov/tools/seerrx/) for instructions for coding immunotherapy, chemotherapeutic and hormonal agents.      Update for 2013 PUF: Six drugs previously classified as Chemotherapy are now classified as BRM/Immunotherapy. This change in classification is effective only for cases diagnosed in January 1st, 2013 and forward. While the NCDB does not provide drug-specific data, changes in case counts may be observed for the Chemotherapy and Immunotherapy variables for cases diagnosed in 2013 due to the change in classification. The drugs are: Alemtuzumab/Campath, Bvacizumab/Avastin, Rituximab, Trastuzumab/Herceptin, Pertuzumab/Perjeta, and Cetuxumab/Erbitux.", 
        "table": {
            "00": [
                "None, immunotherapy was not part of the planned first course of therapy.  Diagnosed at autopsy."
            ], 
            "01": [
                "Immunotherapy administered as first course therapy."
            ], 
            "82": [
                "Immunotherapy was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age)."
            ], 
            "85": [
                " Immunotherapy was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "86": [
                "Immunotherapy was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record."
            ], 
            "87": [
                "Immunotherapy was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "88": [
                "Immunotherapy was recommended, but it is unknown if it was administered."
            ], 
            "99": [
                "It is unknown whether a immunotherapeutic agent(s) was recommended or administered because it is not stated in patient record. Death certificate only."
            ]
        }, 
        "title": "Immunotherapy at This Facility"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": " 0 - 9999", 
        "analytical note": "Agents included for immunotherapy are also known at biologic response modifiers.      CoC cancer programs are required to identify treatment their patients received from all sources.  Immunotherapy may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.  This refers to the first administration of immunotherapy for the cancer by any facility.", 
        "category": "Systemic", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which immunotherapy at any facility was started (NAACCR Item #1240).", 
        "field_name": "DX_IMMUNO_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "Immunotherapy not administered, immunotherapy unknown, or cannot compute days elapsed due to missing or incomplete dates"
            ]
        }, 
        "title": "Immunotherapy, Days from Dx"
    }, 
    {
        "NAACCR Item #": "3250", 
        "allowable_values": "00, 10 -12, 20, 30, 40, 82, 85 - 88, 99", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources.  Procedures may have occurred at any facility, not limited to the one whose report is included in this file.", 
        "category": "Systemic", 
        "description": "Identifies systemic therapeutic procedures performed as part of the first course of treatment at this and all other facilities. If none of these procedures was performed, then this item records the reason why not. These procedures include bone marrow transplants, stem cell harvests, and surgical and/or radiation endocrine therapy.", 
        "field_name": "RX_SUMM_TRNSPLNT_ENDO", 
        "format": null, 
        "length": "2", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Bone marrow transplants should be coded as either autologous (bone marrow originally taken from the patient) or allogeneic (bone marrow donated by a person other than the patient). For cases in which the bone marrow transplant was syngeneic (transplanted marrow from an identical twin), the item is coded as allogeneic.      Stem cell harvests involve the collection of immature blood cells from the patient and the reintroduction by transfusion of the harvested cells following chemotherapy or radiation therapy.      Endocrine irradiation and/or endocrine surgery are procedures which suppress the naturally occurring hormonal activity of the patient and thus alter or effect the long-term control of the cancer's growth. These procedures must be bilateral to qualify as endocrine surgery or endocrine radiation. If only one gland is intact at the start of treatment, surgery and/or radiation to that remaining gland is coded as endocrine surgery or endocrine radiation.      Code 00 if a transplant or endocrine procedure was not administered to the patient, and it is known that these procedures are not usually administered for this type and stage of cancer.      Code 00 if the treatment plan offered multiple options, and the patient selected treatment that did not include a transplant or endocrine procedure.      If it is known that a transplant or endocrine procedure is usually administered for this type and stage of cancer, but was not administered to the patient, use code 82, 85, 86, or 87 to record the reason why it was not administered.      Code 87 if the patient refused a recommended transplant or endocrine procedure, made a blanket refusal of all recommended treatment, or refused all treatment before any was recommended.      Code 99 if it is not known whether a transplant or endocrine procedure is usually administered for this type and stage of cancer, and there is no mention in the patient record whether it was recommended or administered.      If hematologic transplant or endocrine procedure coded in this item was provided to prolong a patient's life by controlling symptoms, to alleviate pain, or to make the patient more comfortable, then also record the hematologic transplant or endocrine procedure provided in the item Palliative Care (NAACCR Item #3270) and/or Palliatiave Care at This Facility (NAACCR Item #3280), as appropriate.", 
        "table": {
            "00": [
                "No transplant procedure or endocrine therapy was administered as part of first course therapy.  Diagnosed at autopsy."
            ], 
            "10": [
                "A bone marrow transplant procedure was administered, but the type was not specified."
            ], 
            "11": [
                "Bone marrow transplant - autologous."
            ], 
            "12": [
                "Bone marrow transplant - allogeneic."
            ], 
            "20": [
                "Stem cell harvest and infusion. Umbilical cord stem cell transplant, with blood from one or multiple umbilical cords."
            ], 
            "30": [
                "Endocrine surgery and/or endocrine radiation therapy."
            ], 
            "40": [
                "Combination of endocrine surgery and/or radiation with a transplant procedure. (Combination of codes 30 and 10, 11, 12, or 20.)"
            ], 
            "82": [
                "Hematologic transplant and/or endocrine surgery/radiation was not recommended/administered because it was contraindicated due to patient risk factors (ie, comorbid conditions, advanced age)."
            ], 
            "85": [
                "Hematologic transplant and/or endocrine surgery/radiation was not administered because the patient died prior to planned or recommended therapy."
            ], 
            "86": [
                "Hematologic transplant and/or endocrine surgery/radiation was not administered. It was recommended by the patient's physician, but was not administered as part of the first course of therapy. No reason was stated in patient record."
            ], 
            "87": [
                "Hematologic transplant and/or endocrine surgery/radiation was not administered. It was recommended by the patient's physician, but this treatment was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in patient record."
            ], 
            "88": [
                "Hematologic transplant and/or endocrine surgery/radiation was recommended, but it is unknown if it was administered."
            ], 
            "99": [
                "It is unknown whether hematologic transplant and/or endocrine surgery/radiation was recommended or administered because it is not stated in patient record. Death certificate only.."
            ]
        }, 
        "title": "Hematologic Transplant and Endocrine Procedures"
    }, 
    {
        "NAACCR Item #": "1639", 
        "allowable_values": "0, 2-6, 9", 
        "analytical note": "This item was added to FORDS for use with cases diagnosed in 2006 or later.       CoC cancer programs are required to identify treatment their patients received from all sources.  Treatment may have occurred at any facility, or at multiple facilities, not limited to the one whose report is included in this file.", 
        "category": "Systemic", 
        "description": "Records the sequencing of systemic treatment and surgical procedures given as part of the first course of treatment.", 
        "field_name": "RX_SUMM_SYSTEMIC_SUR_SEQ", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Surgical procedures include Surgical Procedures of the Primary Site (NAACCR Item #1290, Scope of Regional Lymph Node Surgery (NAACCR Item #1292), and Surgical Procedure/Other Site (NAACCR Item #1294).  Systemic therapy includes Chemotherapy (NAACCR Item #1390), Hormone Therapy (NAACCR Item #1300), Immunotherapy (NAACCR Item #1410) and Hematologic Transplant and Endocrine Procedure (NAACCR Item #3250).  If no surgical procedure was performed, or no systemic treatment was given, this item is coded 0.      If both surgery and systemic treatment were provided for this cancer, then code 2-9, as appropriate.", 
        "table": {
            "0": [
                "No systemic therapy was given; and/or no surgical procedure of primary site; no scope of regional lymph node surgery; no surgery to other regional site(s), distant site(s), or distant lymph node(s); or no reconstructive surgery was performed. Or: It is unknown whether both surgery and systemic treatment were provided."
            ], 
            "2": [
                "Systemic therapy was given before surgical procedure of primary site; scope of regional lymph node surgery; surgery to other regional site(s), distant site(s), or distant lymph node(s) was performed."
            ], 
            "3": [
                "Systemic therapy was given after surgical procedure of primary site; scope of regional lymph node surgery; surgery to other regional site(s), distant site(s), or distant lymph node(s) was performed."
            ], 
            "4": [
                "At least two courses of systemic therapy were given before and at least two more after a surgical procedure of primary site; scope of regional lymph node sugery; surgery to other regional site(s), or distant site(s), or lymph node(s) was performed."
            ], 
            "5": [
                "Intraoperative systemic therapy was given during surgical procedure of primary site; scope of regional lymph node surgery; surgery to other regional site(s), distant site(s), or distant lymph node(s)."
            ], 
            "6": [
                "Intraoperative systemic therapy was given during surgical procedure of primary site; scope of regional lymph node surgery; surgery to other regional site(s), distant site(s), or distant lymph node(s) with other systemic therapy administered before or after surgical procedure of primary site; scope of regional lymph node surgery; surgery to other regional site(s), distant site(s), or distant lymph node(s) was performed."
            ], 
            "7": [
                "Systemic therapy was administered between two separate surgical procedures to the primary site; regional lymph node surgery; surgery to other regional site(s), distant site(s), or distant lymph node(s) with other systemic therapy adminstered before or after surgical procedures to the primary site; regional lymph node surgery; surgery to other regional site(s), distant site(s), or distant lymph node(s) was performed."
            ], 
            "9": [
                "Both surgery and systemic therapy were provided, but the sequence is unknown."
            ]
        }, 
        "title": "Systemic Surgery Sequence"
    }, 
    {
        "NAACCR Item #": "1410", 
        "allowable_values": "0 - 3, 6 - 9", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources.  Other treatment may have been given by any facility, or multiple facilities, not limited to the one whose report is included in this file.  This refers to the first use of other treatment for the cancer by any facility.", 
        "category": "TREATMENT", 
        "description": "Identifies other treatment that cannot be defined as surgery, radiation, or systemic therapy according to the defined data items in this manual.", 
        "field_name": "RX_SUMM_OTHER", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "In order to report the hematopoiectic cases in which the patient received supportive care, SSER and the Commissison on Cancer have agreed to record treatments such as phlebotomy, transfusion, or aspirin as \"Other Treatment\" Code 1 for certain hematopoietic diseases ONLY.  Consult http://seer.cancer.gov/tools/seerrx/ for instructions for coding care of specific hematopoietic neoplasms in this item.      Code 1 for embolization using alcohol as an embolizing agent.      Code 1 for embolization to a site other than the liver where the embolizing agent is unknown.      Code 1 for PUFA (psoralen and long-wave ultraviolet radiation).      Do not code pre-surgical embolization given to shrink the tumor.      Code 8 if it is known that a physician recommended treatment coded as Other Treatment, and no further documentation is available yet to confirm its administration.      Code 8 to indicate referral to a specialist for Other Treatment; the registry should follow.  If follow-up with the specialist or facility determines the patient was never there, code 0.", 
        "table": {
            "0": [
                "None", 
                "All cancer treatment was coded in other treatment fields (surgery, radiation, systemic therapy). Patient received no cancer treatment.  Diagnosed at autopsy."
            ], 
            "1": [
                "Other", 
                "Cancer treatment that cannot be appropriately assigned to specified treatment data items (surgery, radiation, systemic). Use this code for treatment unique to hematopoietic diseases."
            ], 
            "2": [
                "Other-Experimental", 
                "This code is not defined. It may be used to record participation in institution-based clinical trials."
            ], 
            "3": [
                "Other-Double Blind", 
                "A patient is involved in a double-blind clinical trial. Code the treatment actually administered when the double-blind trial code is broken."
            ], 
            "6": [
                "Other-Unproven", 
                "Cancer treatments administered by nonmedical personnel."
            ], 
            "7": [
                "Refusal", 
                "Other treatment was not administered. It was recommended by the patient's physician, but this treatment (which would have been coded 1, 2, or 3) was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in the patient record."
            ], 
            "8": [
                "Recommended; unknown if administered", 
                "Other treatment was recommended, but it is unknown whether it was administered."
            ], 
            "9": [
                "Unknown", 
                "It is unknown whether other treatment was recommended or administered, and there is no information in the medical record to confirm the recommendation or administration of other treatment.  Death certificate only."
            ]
        }, 
        "title": "Other Treatment"
    }, 
    {
        "NAACCR Item #": "730", 
        "allowable_values": "0-3, 6-9", 
        "analytical note": "This item is available only for diagnosis years 2003 and later.      CoC cancer programs are required to identify treatment their patients received from all sources.  Other treatment may have been given by any facility, or multiple facilities, not limited to the one whose report is included in this file.  This refers to the first use of other treatment for the cancer by the reporting facility.", 
        "category": "TREATMENT", 
        "description": "Identifies other treatment given at the reporting facility that cannot be defined as surgery, radiation, or systemic therapy.", 
        "field_name": "RX_HOSP_OTHER", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "In order to report the hematopoiectic cases in which the patient received supportive care, SSER and the Commissison on Cancer have agreed to record treatments such as phlebotomy, transfusion, or aspirin as \"Other Treatment\" Code 1 for certain hematopoietic diseases ONLY.  Consult http://seer.cancer.gov/tools/seerrx/ for instructions for coding care of specific hematopoietic neoplasms in this item.      Code 1 for embolization using alcohol as an embolizing agent.      Code 1 for embolization to a site other than the liver where the embolizing agent is unknown.      Code 1 for PUFA (psoralen and long-wave ultraviolet radiation).      Do not code pre-surgical embolization given to shrink the tumor.      Code 8 if it is known that a physician recommended treatment coded as Other Treatment, and no further documentation is available yet to confirm its administration.      Code 8 to indicate referral to a specialist for Other Treatment; the registry should follow.  If follow-up with the specialist or facility determines the patient was never there, code 0.", 
        "table": {
            "0": [
                "None", 
                "All cancer treatment was coded in other treatment fields (surgery, radiation, systemic therapy). Patient received no cancer treatment.  Diagnosed at autopsy."
            ], 
            "1": [
                "Other", 
                "Cancer treatment that cannot be appropriately assigned to specified treatment data items (surgery, radiation, systemic). Use this code for treatment unique to hematopoietic diseases."
            ], 
            "2": [
                "Other-Experimental", 
                "This code is not defined. It may be used to record participation in institution-based clinical trials."
            ], 
            "3": [
                "Other-Double Blind", 
                "A patient is involved in a double-blind clinical trial. Code the treatment actually administered when the double-blind trial code is broken."
            ], 
            "6": [
                "Other-Unproven", 
                "Cancer treatments administered by nonmedical personnel."
            ], 
            "7": [
                "Refusal", 
                "Other treatment was not administered. It was recommended by the patient's physician, but this treatment (which would have been coded 1, 2, or 3) was refused by the patient, a patient's family member, or the patient's guardian. The refusal was noted in the patient record."
            ], 
            "8": [
                "Recommended; unknown if administered", 
                "Other treatment was recommended, but it is unknown whether it was administered."
            ], 
            "9": [
                "Unknown", 
                "It is unknown whether other treatment was recommended or administered, and there is no information in the medical record to confirm the recommendation or administration of other treatment.  Death certificate only."
            ]
        }, 
        "title": "Other Treatment at This Facility"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0 - 9999", 
        "analytical note": "CoC cancer programs are required to identify treatment their patients received from all sources.  This treatment may have been given by any facility, or multiple facilities, not limited to the one whose report is included in this file.  This refers to the first given for the cancer by any facility.", 
        "category": "TREATMENT", 
        "description": "The number of days between the date of diagnosis (NAACCR Item #390) and the date on which Other Treatment at any facility was started (NAACCR Item #1250).", 
        "field_name": "DX_OTHER_STARTED_DAYS", 
        "format": null, 
        "length": "4", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0 - 9999": [
                "Number of Elapsed Days"
            ], 
            "Blank": [
                "Other therapy not administered, other therapy unknown, or cannot compute elapsed days due to missing or incomplete dates"
            ]
        }, 
        "title": "Other Treatment, Days from Dx"
    }, 
    {
        "NAACCR Item #": "3270", 
        "allowable_values": "0-7, 9", 
        "analytical note": "This data item can be used to distinguish a treatment modality given for curative treatment from the same modality being used strictly for palliation.  This item was added to FORDS in 2003.      If patients are admitted to a hospital for palliative care other than surgery, radiation or systemic treatment, the record often does not indicate the underlying reason for the procedure (for example, other forms of pain care).  Therefore, when the initial care was elsewhere and the care was not one of these three modalities, it is unlikely the care will be reported in this data item.", 
        "category": "TREATMENT", 
        "description": "Identifies any care provided in an effort to palliate or alleviate symptoms. Palliative care is performed to relieve symptoms and may include surgery, radiation therapy,  systemic therapy (chemotherapy, hormone therapy, or other systemic drugs), and/or other pain management therapy.  ", 
        "field_name": "PALLIATIVE_CARE", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Surgical procedures, radiation therapy, or systemic therapy provided to prolong the patient's life by controlling symptoms, to alleviate pain, or to make the patient comfortable should be coded palliative care and as first course therapy if that procedure removes or modifies either primary or metastatic malignant tissue.      Palliative care is not used to diagnose or stage the primary tumor.", 
        "table": {
            "0": [
                "No palliative care provided. Diagnosed at autopsy."
            ], 
            "1": [
                "Surgery (which may involve a bypass procedure) to alleviate symptoms, but no attempt to diagnose, stage, or treat the primary tumor is made."
            ], 
            "2": [
                "Radiation therapy to alleviate symptoms, but no attempt to diagnose, stage, or treat the primary tumor is made."
            ], 
            "3": [
                "Chemotherapy, hormone therapy, or other systemic drugs to alleviate symptoms, but no attempt to diagnose, stage, or treat the primary tumor is made."
            ], 
            "4": [
                "Patient received or was referred for pain management therapy with no other palliative care."
            ], 
            "5": [
                "Any combination of codes 1, 2, and/or 3 without code 4."
            ], 
            "6": [
                "Any combination of codes 1, 2, and/or 3 with code 4."
            ], 
            "7": [
                "Palliative care was performed or referred, but no information on the type of procedure is available in the patient record. Palliative care was provided that does not fit the descriptions for codes 1-6."
            ], 
            "9": [
                "It is unknown if palliative care was performed or referred; not stated in patient record."
            ]
        }, 
        "title": "Palliative Care"
    }, 
    {
        "NAACCR Item #": "3280", 
        "allowable_values": "0-7, 9", 
        "analytical note": "This data item can be used to distinguish a treatment modality given for curative treatment from the same modality being used strictly for palliation. This item was added to FORDS in 2003.      If patients are admitted to a hospital for palliative care other than surgery, radiation or systemic treatment, the record often does not indicate the underlying reason for the procedure (for example, other forms of pain care).  Therefore, when the initial care was elsewhere and the care was not one of these three modalities, it is unlikely the care will be reported in this data item.      This item identifies palliative care given at the reporting facility. The item Palliative Care identifies palliative care given by any facility.", 
        "category": "TREATMENT", 
        "description": "Identifies any care provided in an effort to palliate or alleviate symptoms at the reporting facility. Palliative care is performed to relieve symptoms and may include surgery, radiation therapy,  systemic therapy (chemotherapy, hormone therapy, or other systemic drugs), and/or other pain management therapy. This data item was added to the 2015 PUF (data released in Fall 2017), and does not appear in prior versions of the PUF data.", 
        "field_name": "PALLIATIVE_CARE_HOSP", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "Record only the type of palliative care at this facility.      Surgical procedures, radiation therapy, or systemic therapy provided to prolong the patient's life by controlling symptoms, to alleviate pain, or to make the patient comfortable should be coded palliative care and as first course therapy if that procedure removes or modifies either primary or metastatic malignant tissue.      Palliative care is not used to diagnose or stage the primary tumor.", 
        "table": {
            "0": [
                "No palliative care provided. Diagnosed at autopsy."
            ], 
            "1": [
                "Surgery (which may involve a bypass procedure) to alleviate symptoms, but no attempt to diagnose, stage, or treat the primary tumor is made."
            ], 
            "2": [
                "Radiation therapy to alleviate symptoms, but no attempt to diagnose, stage, or treat the primary tumor is made."
            ], 
            "3": [
                "Chemotherapy, hormone therapy, or other systemic drugs to alleviate symptoms, but no attempt to diagnose, stage, or treat the primary tumor is made."
            ], 
            "4": [
                "Patient received or was referred for pain management therapy with no other palliative care."
            ], 
            "5": [
                "Any combination of codes 1, 2, and/or 3 without code 4."
            ], 
            "6": [
                "Any combination of codes 1, 2, and/or 3 with code 4."
            ], 
            "7": [
                "Palliative care was performed or referred, but no information on the type of procedure is available in the patient record. Palliative care was provided that does not fit the descriptions for codes 1-6."
            ], 
            "9": [
                "It is unknown if palliative care was performed or referred; not stated in patient record."
            ]
        }, 
        "title": " Palliative Care at This Facility"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0, 1, 9", 
        "analytical note": "The computation was based on the Date of Most Definitive Surgical Resection of the Primary Site (NAACCR Item #3170) if that is known. Otherwise, it was based on the Date of the First Surgical Procedure (NAACCR Item #1200). In either case, the Date of Last Contact or Death (NAACCR Item #1750) was subtracted from the surgery date and patient Vital Status (NAACCR Item #1760) indicated whether the latter date referred to contact or death. Eligible cases are limited to Surgical Procedure of the Primary Site codes 20-90 (NAACCR Item #1290). Thirty Day Mortality is blank for patients diagnosed in 2015. Investigators analyzing surgical mortality at the facility level must use the Surgery of the Primary Site at this Facility variable (item RX_HOSP_SURG_PRIM_SITE) to determine if the surgery was performed at the facility included in the PUF data. See the Getting Started document for more information.", 
        "category": "OUTCOMES", 
        "description": "This item indicates mortality within 30 days of the most definitive primary site surgery.", 
        "field_name": "PUF_30_DAY_MORT_CD", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {
            "0": [
                "Patient alive, or died more than 30 days after surgery performed"
            ], 
            "1": [
                "Patient died 30 or fewer days after surgery performed"
            ], 
            "9": [
                "Patient alive with fewer than 30 days of follow-up, surgery date missing, or last contact date missing"
            ], 
            "Blank": [
                "Not eligible; surgical resection unknown or not performed, or diagnosed in 2015"
            ]
        }, 
        "title": "Thirty Day Mortality"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0, 1, 9", 
        "analytical note": "The computation was based on the Date of Most Definitive Surgical Resection of the Primary Site (NAACCR #3170) if that was known.  Otherwise, it was based on the Date of First Surgical Procedure (NAACCR Item #1200).  In either case, the Date of Last Contact or Death (NAACCR Item #1750) was subtracted from the surgery date and patient Vital Status (NAACCR Item #1760) indicated whether the latter date referred to contact or death. Eligible cases are limited to Surgical Procedure of the Primary Site codes 20-90 (NAACCR Item #1290). Ninety Day Mortality is blank for patients diagnosed in 2015. Investigators analyzing surgical mortality at the facility level must use the Surgery of the Primary Site at this Facility variable (item RX_HOSP_SURG_PRIM_SITE) to determine if the surgery was performed at the facility included in the PUF data. See the Getting Started document for more information.", 
        "category": "OUTCOMES", 
        "description": "This item indicates mortality within 90 days after the most definitive primary site surgery.", 
        "field_name": "PUF_90_DAY_MORT_CD", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {
            "0": [
                "Patient alive, or died more than 90 days after surgery performed"
            ], 
            "1": [
                "Patient died 90 or fewer days after surgery performed"
            ], 
            "9": [
                "Patient alive with fewer than 90 days of follow-up, surgery date missing, or last contact date missing"
            ], 
            "Blank": [
                "Not eligible; surgical resection unknown or not performed, or diagnosed in 2015"
            ]
        }, 
        "title": "Ninety Day Mortality"
    }, 
    {
        "NAACCR Item #": null, 
        "allowable_values": "0000.1 - 8887.9, 9999.0", 
        "analytical note": "Months Elapsed is blank for patients diagnosed in 2015. See \"Getting Started\" for a discussion of survival calculations for patients diagnosed recently.", 
        "category": "OUTCOMES", 
        "description": "The number of months between the date of diagnosis (NAACCR Item #390) and the date on which the patient was last contacted or died (NAACCR Item #1750).", 
        "field_name": "DX_LASTCONTACT_DEATH_MONTHS", 
        "format": null, 
        "length": "6", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": "None.", 
        "table": {
            "0000.1 - 8887.9": [
                "Number of elapsed months"
            ], 
            "Blank": [
                "Unknown, number of elapsed months can not be computed"
            ]
        }, 
        "title": "Last Contact or Death, Months from Dx"
    }, 
    {
        "NAACCR Item #": "1760", 
        "allowable_values": "0, 1", 
        "analytical note": "Vital Status is blank for cases diagnosed in 2015.  See \"Getting Started\" for an explanation about calculating survival for cases diagnosed recently.      Vital Status is the only item for which SEER and CoC agreed to retain different codes to mean the same thing.  For historic reasons, SEER uses code 4 for deceased patients while CoC uses 0.  All 4s in the CoC database were converted to 0 for the PUF file.  There is no Vital Status code for \"unknown\".  Therefore, cases for which the code was not valid are transmitted as blank.  They may have been submitted as blanks, 9s, or any other non-defined value.  They can be analyzed as \"unknown\" or omitted from analysis, depending on the needs of the study.", 
        "category": "OUTCOMES", 
        "description": " Records the vital status of the patient as of the date entered in Date of Last Contact or Death (NAACCR Item #1750), which is the status of the patient at the end of Elapsed Months - Date of Diagnosis to Date of Last Contact or Death in the PUF.", 
        "field_name": "PUF_VITAL_STATUS", 
        "format": null, 
        "length": "1", 
        "ncdb_system_code_assignments": null, 
        "registry_coding_instructions": null, 
        "table": {
            "0": [
                "Dead"
            ], 
            "1": [
                "Alive"
            ], 
            "Blank": [
                "Not available"
            ]
        }, 
        "title": "PUF Vital Status"
    }
]